Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: Generally, we recommend that you use `SPDX-FileCopyrightText: [year] [copyright holder] <[contact address]>`. You may choose to drop items except the copyright holder, which must always be included. We recommend that you include all items, however.
es: Por lo general, se recomienda utilizar `SPDX-FileCopyrightText: [año] [titular del copyright] <[contact address]>`. Puedes optar por descartar elementos excepto el titular de los derechos de autor, que debe incluirse siempre. No obstante, recomendamos que incluyas todos los elementos.
uk: Як правило, ми рекомендуємо вживати `SPDX-FileCopyrightText: [year] [copyright holder] <[contact address]>`. Ви можете відмовитися від усіх елементів, окрім власника авторських прав, які завжди повинні бути долучені. Проте радимо долучити всі елементи.

source: The specification includes a section on the exact format of the copyright notice. See [the specification](/spec) and [the next question](#copyright-symbol).
es: La especificación incluye una sección sobre el formato exacto del aviso de derechos de autor. Ver [la especificación](/spec) y [la siguiente pregunta](#copyright-symbol).
fr: La spécification comprend une section sur le format exact de l'avis de droit d'auteur. Voir [la spécification](/spec) et [la question suivante](#copyright-symbol).
uk: Специфікація включає розділ із точним форматом повідомлення про авторські права. Дивіться [специфікацію](/spec) та [наступне запитання](#copyright-symbol).

source: Do I use SPDX-FileCopyrightText, Copyright, or ©? {#copyright-symbol}
es: ¿Utilizo SPDX-FileCopyrightText, Copyright, o ©? {#copyright-symbol}
fr: Dois-je utiliser SPDX-FileCopyrightText, Copyright ou © ? {#copyright-symbol}
uk: Чи користуюсь я SPDX-FileCopyrightText, авторським правом або ©? {#copyright-symbol}

source: The specification lists the following copyright notices as valid:
es: El pliego de especificaciones considera válidos los siguientes avisos de derechos de autor:
fr: La spécification répertorie les avis de droits d'auteur suivants comme valides :
uk: Специфікація містить такі повідомлення про авторські права які вважаються чинними:

source: SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> SPDX-FileCopyrightText: © 2019 John Doe <joe@example.com> © Example Corporation <https://corp.example.com> Copyright 2016, 2018-2019 Joe Anybody Copyright (c) Alice
es: SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> SPDX-FileCopyrightText: © 2019 John Doe <joe@example.com> © Corporación Ejemplo <https://corp.example.com> Copyright 2016, 2018-2019 Joe Anybody Copyright (c) Alice

source: Out of those, the first two are highly recommended. The others exist primarily to be compatible with existing conventions.
es: De ellas, las dos primeras son muy recomendables. Las otras existen principalmente para ser compatibles con las convenciones existentes.
fr: Parmi ceux-ci, les deux premiers sont fortement recommandés. Les autres existent principalement pour être compatibles avec les conventions existantes.
uk: З них перші два — найрекомендованіші. Інші існують насамперед для сумісності з наявними конвенціями.

source: <!-- TODO: Link to another question about © -->
es: <!-- TODO: Enlace a otra pregunta sobre © -->
fr: <!-- TODO: Lien vers une autre question sur © -->
uk: <!-- TODO: Посилання на інше запитання про © -->

source: Which years do I include in the copyright statement? {#years-copyright}
es: ¿Qué años debo incluir en la declaración de derechos de autor? {#years-copyright}
fr: Quelles années dois-je inclure dans la déclaration de droits d'auteur ? {#years-copyright}
uk: Які роки включати до повідомлення про авторські права? {#years-copyright}

source: Generally, there are four options for you to choose:
es: Normalmente hay cuatro opciones para elegir:
fr: En règle générale, vous avez le choix entre quatre options :
uk: Загалом є чотири варіанти на вибір:

source: The year of initial publication.
es: El año de publicación inicial.
fr: L'année de la publication initiale.
uk: Рік першої публікації.

source: The year of the latest publication.
es: El año de la última publicación.
fr: L'année de la dernière publication.
uk: Рік останньої публікації.

source: All years of publications, either as range (e.g., 2017-2019) or as separate entries (e.g., 2017, 2018, 2019).
es: Todos los años de publicaciones, ya sea como rango (e.g., 2017-2019) o como entradas separadas (e.g., 2017, 2018, 2019).
fr: Toutes les années de publications, soit sous forme d'intervalle (par exemple, 2017-2019) ou sous forme d'entrées distinctes (par exemple, 2017, 2018, 2019).
uk: Всі роки публікації, або діапазоном (наприклад, 2017-2019), або окремими записами (наприклад, 2017, 2018, 2019).

source: Do not include any year.
es: No incluir ningún año.
fr: N'inclure aucune année.
uk: Не включати жодного року.

source: Which option you choose is ultimately up to you.
es: La opción que elijas depende en última instancia de ti.
fr: L'option que vous choisissez dépend en fin de compte de vous.
uk: Який варіант ви виберете зрештою залежить від вас.

source: Do I need to include both GPL-3.0-or-later and GPL-3.0-only in my repository? {#gpl-plus}
es: ¿Debo incluir en mi repositorio tanto la GPL-3.0-o-posterior como la GPL-3.0.solo? {#gpl-plus}
fr: Dois-je inclure à la fois la GPL-3.0-ou-ultérieure et la GPL-3.0-uniquement dans mon référentiel ? {#gpl-plus}
uk: Чи потрібно включати до свого репозиторію і «GPL-3.0-or-later», так і «GPL-3.0-only»? {#gpl-plus}

source: Members of the GPL family are listed separately in the SPDX License List as -only and -or-later, even though the license texts are identical. If you have code under only one of these licenses, we recommend that you only include that one license.
es: Los miembros de la familia GPL se enumeran por separado en la Lista de Licencias SPDX como -sólo y o más, aunque los textos de licencia sean idénticos. Si solo tienes una de estas licencias, le recomendamos que sólo incluya esa licencia.
fr: Les membres de la famille GPL sont répertoriés séparément dans la liste des licences SPDX en tant que -only et -or-later, même si les textes de licence sont identiques. Si vous avez du code sous une seule de ces licences, nous vous recommandons de n'inclure qu'une seule licence.
uk: Ліцензії GPL перераховані окремо у списку ліцензій SPDX як -only, так і -or-later, навіть якщо тексти ліцензій ідентичні. Якщо у вас є код лише під однією з цих ліцензій, радимо включити лише таку ж ліцензію.

source: If you have code under both an -only license and an -or-later license, we recommend that you include both licenses separately.
es: Si tiene ambas licencias -sólo una licencia y otra, le recomendamos que incluyas ambas licencias por separado.
fr: Si vous avez du code à la fois sous une licence -only et une licence -or-later, nous vous recommandons d'inclure les deux licences séparément.
uk: Якщо у вас є код і за ліцензією -only, і за ліцензією -or-later, радимо включити обидві ліцензії окремо.

source: What are license exceptions and what do I do with them? {#license-exceptions}
es: ¿Qué son las excepciones de licencia y qué hago con ellas? {#license-exceptions}
fr: Que sont les exceptions de licence et que dois-je en faire ? {#license-exceptions}
uk: Що таке ліцензійні винятки та що з ними робити? {#license-exceptions}

source: License exceptions are additions or alterations to a license that often work to permit a certain use of the code that wouldn't be allowed under the original license. It is often used by compilers, where a portion of compiler code may end up in the resulting binary. The exception may waive rights over portions of code that end up in binaries.
es: Las excepciones de licencia son añadidos o alteraciones de una licencia que a menudo sirven para permitir un cierto uso del código que no se permitiría bajo la licencia original. A menudo lo utilizan los compiladores, donde una parte del código compilador puede terminar en el binario resultante. La excepción puede ser renunciar a derechos sobre porciones de código que terminan en binarios.
fr: Les exceptions de licence sont des ajouts ou des modifications à une licence qui fonctionnent souvent pour permettre une certaine utilisation du code qui ne serait pas autorisée sous la licence d'origine. Elles sont souvent utilisées par les compilateurs, où une partie du code du compilateur peut se retrouver dans le binaire résultant. L'exception peut renoncer à des droits sur des parties de code qui se retrouvent dans des binaires.
uk: Винятком з ліцензій є доповнення або зміни до ліцензії, які часто потрібні, щоб дозволити певне використання коду, яке не допускається оригінальною ліцензією. Це часто застосовується компіляторами, де частина коду компілятора може виявитися в отриманому двійковому файлі. Виняток може дозволити відмовитися від прав на частини коду, які знаходяться у двійкових файлах.

source: Exceptions are treated almost identically to licenses. In order to combine a license with an exception, you mark a file with the following tag: `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.
es: Las excepciones se tratan casi de manera idéntica a las licencias. Para combinar una licencia con una excepción, marca un archivo con la siguiente etiqueta: `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.
fr: Les exceptions sont traitées presque de la même manière que les licences. Pour combiner une licence avec une exception, vous marquez un fichier avec la balise suivante : `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.
uk: Винятки трактуються майже однаково з ліцензіями. Щоб поєднати ліцензію з винятком, потрібно позначити файл таким тегом: `SPDX-License-Identifier: GPL-3.0-or-later WITH GCC-exception-3.1`.

source: Which files are copyrightable? {#what-is-copyrightable}
es: ¿Qué archivos están sujetos a derecho de autor? {#what-is-copyrightable}
fr: Quels fichiers sont protégés par le droit d'auteur ? {#what-is-copyrightable}
uk: Які файли захищені авторським правом? {#what-is-copyrightable}

source: All files that are original works of authorship are copyrightable. In essence, if someone sat down typing their own original thoughts on a keyboard, then that person holds copyright over the output. Common examples are source code, documentation, audio, and video.
es: Todos los archivos que son trabajos originales de autoría tienen derechos de autor. En esencia, si alguien escribe sus ideas originales en un teclado, entonces esa persona tiene el copyright del resultado. Ejemplos comunes son código fuente, documentación, audio y vídeo.
fr: Tous les fichiers qui sont des œuvres originales de l'auteur sont protégés par le droit d'auteur. En substance, si quelqu'un s'assit en tapant ses propres pensées originales sur un clavier, alors cette personne détient le droit d'auteur sur la sortie. Les exemples courants sont le code source, la documentation, l'audio et la vidéo.
uk: Всі файли, які є оригінальними авторськими продуктами, захищаються авторським правом. По суті, якщо хтось набрав свої оригінальні думки на клавіатурі, то ця людина має авторські права на отриманий твір. Поширеними прикладами є джерельний код, документація, аудіо та відео.

source: There are some edge cases, however. For instance, the program `print("Hello, REUSE!")` probably does not meet the threshold of originality. Similarly, data files and configuration files may not meet that threshold either.
es: Sin embargo, hay algunos casos en el límite. Por ejemplo, el programa `print("¡Hola, REUSE!")` probablemente no cumple el umbral de originalidad. Igualmente, los archivos de datos y los de configuración tampoco pueden cumplir ese umbral.
fr: Il existe cependant des cas extrêmes. Par exemple, le programme `print("Hello, REUSE!")` Ne répond probablement pas au seuil d'originalité. De même, les fichiers de données et les fichiers de configuration peuvent ne pas atteindre ce seuil non plus.
uk: Однак є деякі крайні випадки. Наприклад, програма `print("Hello, REUSE!")`, ймовірно, не відповідає визначенню оригінальності. Аналогічним чином, файли даних і файли конфігурації також можуть не відповідати цьому визначенню.

source: What to do with uncopyrightable files? {#uncopyrightable}
es: ¿Qué hacer con archivos incopiables? {#uncopyrightable}
fr: Que faire des fichiers non protégés par le droit d'auteur ? {#uncopyrightable}
uk: Що робити з файлами, які не можна захистити авторським правом? {#uncopyrightable}

source: There are two things that you can do with such a file to make sure that its copyright and licensing is recorded. The first option is to simply use your regular copyright and license header for this file. There is nothing that stops you from claiming copyright over your own works. However, a court would still likely find such files uncopyrightable.
es: Hay dos cosas que puedes hacer con un archivo para asegurarte de que sus derechos de autor y licencias están registrados. La primera opción es simplemente usar tu cabecera regular de copyright y licencia para este archivo. No hay nada que te impida reclamar derechos de autor sobre tus propios trabajos. Sin embargo, es probable que un tribunal encuentre esos archivos sin derechos.
fr: Il y a deux choses que vous pouvez faire avec un tel fichier pour vous assurer que ses droits d'auteur et ses licences sont enregistrés. La première option consiste simplement à utiliser votre droit d'auteur et votre en-tête de licence habituels pour ce fichier. Rien ne vous empêche de revendiquer des droits d'auteur sur vos propres œuvres. Cependant, un tribunal jugerait toujours que ces fichiers ne sont pas protégés par le droit d'auteur.
uk: Є два варіанти, що можна зробити з таким файлом, щоб переконатися, що авторські права та ліцензування щодо нього записані. Перший варіант полягає — просто скористатися вашими звичайними авторськими правами та заголовком з ліцензією для цього файлу. Немає нічого, що заважає вам претендувати на авторські права на власні твори. Однак суд все одно, швидше за все, знайде такі файли такими, що не можуть бути ліцензованими.

source: The alternative is to waive your copyright by using the [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/) license.
es: La alternativa es renunciar a tus derechos de autor utilizando la licencia [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/).
fr: L'alternative est de renoncer à vos droits d'auteur en utilisant la licence [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/).
uk: Альтернативою є відмова від авторських прав за допомогою ліцензії [CC0-1.0](https://creativecommons.org/publicdomain/zero/1.0/).

source: It is important to note that you can only do this for your own works. If the file was authored by someone else, you must declare their copyright and license in the header.
es: Es importante señalar que solo puedes hacer esto con tus propios trabajos. Si el autor del archivo fue otra persona, debe declarar su copyright y licencia en el encabezado.
fr: Il est important de noter que vous ne pouvez le faire que pour vos propres œuvres. Si le fichier a été créé par quelqu'un d'autre, vous devez déclarer ses droits d'auteur et sa licence dans l'en-tête.
uk: Важливо зазначити, що ви можете застосувати це лише щодо власних робіт. Якщо файл був створений кимось іншим, ви повинні заявити про свої авторські права та ліцензію в заголовку.

source: How do I copy someone else's work? {#copy-work}
es: ¿Cómo copio el trabajo de otra persona? {#copy-work}
fr: Comment copier le travail de quelqu'un d'autre ? {#copy-work}
uk: Як скопіювати чужу роботу? {#copy-work}

source: If someone else has made their work available for you to use and copy, you can incorporate their work into your project. When you put the work in one of the files in your project, you should add an `SPDX-FileCopyrightText` tag for the copyright holder(s) and an `SPDX-License-Identifier` tag for the license(s) under which the work was made available.
es: Si alguien más ha puesto su trabajo disponible para que lo puedas usar y copiar, puedes incorporar su trabajo en tu proyecto. Cuando pones el trabajo en uno de los archivos de tu proyecto, debes añadir una etiqueta `SPDX-FileCopyrightText` para el titular(s) de derechos de autor y una etiqueta `SPDX-License-Identifier` para la licencia(s) bajo la cual el trabajo está disponible.
fr: Si quelqu'un d'autre a mis son travail à votre disposition pour que vous puissiez l'utiliser et le copier, vous pouvez incorporer son travail dans votre projet. Lorsque vous placez le travail dans l'un des fichiers de votre projet, vous devez ajouter une balise `SPDX-FileCopyrightText` pour le(s) détenteur(s) des droits d'auteur et une balise `SPDX-License-Identifier` pour la ou les licences sous lesquelles le travail a été rendu disponible.
uk: Якщо хтось інший зробив ваші роботи доступними для користування та копіювання, ви можете включити їхні роботи у свій проєкт. Коли ви розміщуєте роботу в одному з файлів у своєму проєкті, вам слід додати тег `SPDX-FileCopyrightText` для власників авторських прав та тег `SPDX-License-Identifier` для ліцензій, за якими ви надаєте свою роботу.

source: If the work was licensed differently from your project, you should verify whether the licenses are compatible, and add the new licenses to your project.
es: Si la licencia del trabajo es diferente de la tu proyecto, debes verificar si las licencias son compatibles, y añadir las nuevas licencias a tu proyecto.
fr: Si l'œuvre a reçu une licence différente de celle de votre projet, vous devez vérifier si les licences sont compatibles et ajouter les nouvelles licences à votre projet.
uk: Якщо роботу ліцензовано інакше ніж у вашому проєкті, слід перевірити, чи сумісні ліцензії та додати нові ліцензії до свого проєкту.

source: Can I copy a work that has no copyright notice or license? {#no-copyright-license}
es: ¿Puedo copiar un trabajo que no tiene ningún aviso de copyright o licencia? {#no-copyright-license}
fr: Puis-je copier une œuvre sans avis de droit d'auteur ni licence ? {#no-copyright-license}
uk: Чи можу я скопіювати роботу, яка не має повідомлення про авторські права або ліцензії? {#no-copyright-license}

source: Before you proceed, always first make sure that you can find the copyright and licensing information elsewhere. Some projects only include this information in the root directory or in their README file.
es: Antes de proceder, asegúrate siempre de que poder encontrar la información de copyright y licencias en otro lugar. Algunos proyectos sólo incluyen esta información en el directorio raíz o en su archivo README.
fr: Avant de continuer, assurez-vous toujours que vous pouvez trouver les informations de copyright et de licence ailleurs. Certains projets n'incluent ces informations que dans le répertoire racine ou dans leur fichier README.
uk: Перш ніж продовжити, завжди спочатку переконайтеся, що ви можете знайти відомості про авторські права та ліцензування в іншому місці. Деякі проєкти містять цю інформацію лише у кореневому каталозі або у файлі README.

source: If you can find no copyright notice, then that is no problem. You can add the copyright notice yourself.
es: Si no puedes encontrar ningún aviso de copyright, entonces eso no es problema. Puedes agregar el aviso de copyright tu mismo.
fr: Si vous ne trouvez aucun avis de droit d'auteur, ce n'est pas un problème. Vous pouvez ajouter vous-même l'avis de droit d'auteur.
uk: Якщо ви не можете знайти повідомлення про авторські права, то це не проблема. Ви можете самостійно додати повідомлення про авторські права.

source: If the work has no license, then that means that you do not have the right to copy it. If you believe that this is a mistake and the author clearly meant for you to be able to copy this work, you should contact the author and ask them to license their work. Feel free to refer them to <https://reuse.software>.
es: Si el trabajo no tiene licencia, entonces eso significa que no tienes derecho a copiarlo. Si crees que se trata de un error y que el autor tenía la clara intención de que pudieras copiar esta obra, deberías ponerte en contacto con el autor y pedirle la licencia de su obra. No dudes en remitirlos a <https://reuse.software>.
fr: Si l'œuvre n'a pas de licence, cela signifie que vous n'avez pas le droit de la copier. Si vous pensez qu'il s'agit d'une erreur et que l'auteur a clairement voulu que vous puissiez copier cette œuvre, vous devez contacter l'auteur et lui demander de lui accorder une licence. N'hésitez pas à les renvoyer vers <https://reuse.software>.
uk: Якщо робота не має ліцензії, то це означає, що ви не маєте права її копіювати. Якщо ви вважаєте, що це помилка, і автор явно мав на увазі, що ви можете скопіювати цю роботу, вам слід зв'язатися з автором і попросити його ліцензувати свої роботи. Не соромтеся посилатися на <https://reuse.software>.

source: Where else do I put my license information? {#where-else}
es: ¿Dónde más puedo poner la información de mi licencia? {#where-else}
fr: Où puis-je aussi mettre mes informations de licence ? {#where-else}
uk: Де ще можна розмістити відомості про ліцензію? {#where-else}

source: Marking all individual files with `SPDX-License-Identifier` tags goes a long way towards unambiguously communicating the license information of your project, but it helps to communicate the license information in natural language as well. In the README of your project, feel free to provide a summary of the licensing information, or simply redirect the reader to your `LICENSES/` directory.
es: Marcar todos los archivos individuales con etiquetas `SPDX-License-Identifier` contribuye en gran medida a comunicar de forma inequívoca la información de la licencia del proyecto, pero también ayuda a comunicar la información de la licencia en lenguaje natural. En el README del proyecto, no dudes en poner un resumen de la información sobre licencias, o simplemente redirecciona al lector a tu directorio `LICENSES/`.
fr: Marquer tous les fichiers individuels avec des balises `SPDX-License-Identifier` permet de communiquer sans ambiguïté les informations de licence de votre projet, mais cela aide également à communiquer les informations de licence en langage naturel. Dans le README de votre projet, n'hésitez pas à fournir un résumé des informations de licence, ou simplement rediriger le lecteur vers votre répertoire `LICENSES/`.
uk: Позначення всіх окремих файлів тегами `SPDX-License-Identifier` проходить тривалий шлях до однозначної передачі ліцензійної інформації вашого проєкту, але це також допомагає донести інформацію про ліцензію природною мовою. У README вашого проєкту не соромтеся надавати підсумкові відомості про свою ліцензію або просто перенаправляйте читачів до вашого каталогу `LICENSES/`.
