Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: You find your license in the [SPDX License List](https://spdx.org/licenses/). SPDX is an open standard for communicating license and copyright information. Each license is uniquely identified by a shortform [SPDX License Identifier](https://spdx.org/licenses). The SPDX License Identifier for your chosen license is GPL-3.0-or-later.
es: Encontrará su licencia en la [Lista de licencias SPDX](https://spdx.org/licenses/). SPDX es un estándar abierto para dar información sobre licencias y derechos de autor. Cada licencia se identifica de forma única mediante una forma abreviada [Identificador de licencia SPDX](https://spdx.org/licenses). El identificador de licencia SPDX para su licencia elegida es GPL-3.0 o posterior.
fr: Vous trouvez votre licence dans la [Liste des licences SPDX](https://spdx.org/licenses/). SPDX est une norme ouverte pour la communication des informations de licence et de droit d'auteur. Chaque licence est identifiée de manière unique par un raccourci [Identificateur de licence SPDX](https://spdx.org/licenses). L'identifiant de licence SPDX pour la licence choisie est GPL-3.0-or-later.
uk: Ви знайдете свою ліцензію в [Списку ліцензій SPDX](https://spdx.org/licenses/). SPDX — це відкритий стандарт для повідомлення про ліцензії та авторські права. Кожна ліцензія однозначно ідентифікується за допомогою короткої форми [Ідентифікатора ліцензії SPDX](https://spdx.org/licenses). Ідентифікатор ліцензії SPDX для вибраної ліцензії — GPL-3.0 або новішої версії.

source: You create a `LICENSES` directory in your project root which will contain all the licenses that you use in your project. You then download your license from the [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) repository and put it in the `LICENSES` directory. The name of the license should be its SPDX License Identifier followed by a file extension (in this example, GPL-3.0-or-later.txt).
es: Crea un directorio `LICENCIAS` en la raíz de su proyecto que contendrá todas las licencias que use en el mismo. Luego descarga su licencia del repositorio [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) y la coloca en el directorio `LICENSES`. El nombre de la licencia debe ser el Identificador de Licencia SPDX seguido de una extensión de archivo (en este ejemplo, GPL-3.0-or-later.txt).
fr: Vous créez un répertoire `LICENSES` dans la racine de votre projet qui contiendra toutes les licences que vous utilisez dans votre projet. Vous téléchargez ensuite votre licence depuis le référentiel [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) et placez-la dans le répertoire `LICENSES`. Le nom de la licence doit être son identifiant de licence SPDX suivi d'une extension de fichier (dans cet exemple, GPL-3.0-or-later.txt).
uk: Ви створюєте каталог `LICENSES` у кореневому каталозі проєкту, який міститиме всі ліцензії, які використовуються у вашому проєкті. Потім ви завантажуєте свою ліцензію з репозиторію [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) і розміщуєте її до каталогу `LICENSES`. Назва ліцензії має бути ідентифікатором ліцензії SPDX та розширенням файлу (у цьому прикладі GPL-3.0-or-later.txt).

source: {{< box-tool >}}
es: {{< caja-herramienta >}}

source: You can initialise your project using `reuse init`. In an interactive dialogue you can define certain properties of your project and also one or multiple licenses. At the end, these licenses will be automatically downloaded to the correct location.
es: Puede inicializar su proyecto usando `reuse init`. En un diálogo interactivo puede definir ciertas propiedades de su proyecto y también una o varias licencias. Al final, estas licencias se descargarán automáticamente en la ubicación correcta.
fr: Vous pouvez initialiser votre projet en utilisant `reuse init`. Dans une boîte de dialogue interactive, vous pouvez définir certaines propriétés de votre projet ainsi qu'une ou plusieurs licences. À la fin, ces licences seront automatiquement téléchargées au bon emplacement.
uk: Ви можете ініціалізувати свій проєкт за допомогою `reuse init`. В інтерактивному діалоговому вікні ви можете визначити певні властивості вашого проєкту, а також одну або кілька ліцензій. Наприкінці ці ліцензії буде автоматично завантажено у правильне місце.

source: The `reuse download` command enables you to download a specific license. `reuse download GPL-3.0-or-later` would fulfil the task described in the manual instructions above. Running `reuse download --all` automatically downloads all licenses which the REUSE helper tool detects as being used in your project.
es: El comando `reuse download` le permite descargar una licencia específica. `reuse download GPL-3.0-or-later` cumpliría la tarea descrita en las instrucciones del manual anterior. Ejecutar `reuse download --all` descarga automáticamente todas las licencias que la herramienta de ayuda REUSE detecta como utilizadas en su proyecto.
fr: La commande `reuse download` vous permet de télécharger une licence spécifique. `reuse download GPL-3.0-or-later` remplirait la tâche décrite dans les instructions du manuel ci-dessus. L'exécution de `reuse download --all` télécharge automatiquement toutes les licences que l'outil d'assistance REUSE détecte comme étant utilisées dans votre projet.
uk: Команда `reuse download` дає змогу завантажити певну ліцензію. `reuse download GPL-3.0-or-later` виконає завдання, описане в інструкціях вище. Запуск `reuse download --all` автоматично завантажує всі ліцензії, які допоміжний засіб REUSE виявляє, якщо вони використовуються у вашому проєкті.

source: Now that you have a license, you need to indicate in the relevant files that these files fall under that license. You edit the comment header of `src/main.c` as such:
es: Ahora que ya tiene una licencia, debe indicar en los archivos relevantes que estos archivos se encuentran bajo esa licencia. Edite el encabezado del comentario de `src/main.c` así:
fr: Maintenant que vous disposez d'une licence, vous devez indiquer dans les fichiers correspondants que ces fichiers relèvent de cette licence. Vous modifiez l'en-tête de commentaire de `src/main.c` comme tel :
uk: Тепер, коли у вас є ліцензія, вам потрібно вказати у відповідних файлах, що ці файли підпадають під цю ліцензію. Ви редагуєте заголовок коментаря `src/main.c` таким чином:

source: /* * SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> * * SPDX-License-Identifier: GPL-3.0-or-later */
es: /* * SPDX-FileCopyrightText: 2019 Jane Doe <jane@example.com> * * SPDX-License-Identifier: GPL-3.0-o-posterior */

source: The `SPDX-FileCopyrightText` tag records the publication years and copyright holder of the contents of the file. You can read more about [which publication years to use]({{< relref "faq.md#years-copyright" >}}) and [what copyright holders are]({{< relref "faq.md#copyright-holder-author" >}}) in the FAQ.
es: La etiqueta `SPDX-FileCopyrightText` registra los años de publicación y el titular de los derechos de autor del contenido del archivo.. Puede leer más sobre [qué años de publicación usar]({{< relref "faq.md#years-copyright" >}}) y [qué titulares de derechos de autor]({{< relref "faq.md#copyright-holder -autor" >}}) en las preguntas frecuentes.
fr: La balise `SPDX-FileCopyrightText` enregistre les années de publication et le titulaire du droit d'auteur du contenu du fichier. Vous pouvez en savoir plus sur [les années de publication à utiliser]({{< relref "faq.md#years-copyright" >}}) et [quels sont les titulaires de droits d'auteur]({{< relref "faq.md#copyright-holder-author" >}}) dans la FAQ.
uk: Тег `SPDX-FileCopyrightText` фіксує роки публікації та власника авторських прав на вміст файлу. Читайте докладніше [які роки публікації використовувати]({{< relref "faq.md#years-copyright" >}}) та [які існують власники авторських прав]({{< relref "faq.md#copyright-holder-author" >}}) у поширених запитаннях.

source: The `SPDX-License-Identifier` tag is followed by a [valid SPDX License Expression](https://spdx.org/specifications), typically just the SPDX License Identifier of the license.
es: La etiqueta `SPDX-License-Identifier` va seguida de una [Expresión de Licencia SPDX válida] (https://spdx.org/specifications), normalmente sólo el Identificador de Licencia SPDX de la licencia.
fr: La balise `SPDX-License-Identifier` est suivie d'une [expression de licence SPDX valide](https://spdx.org/specifications), généralement juste l'identifiant de licence SPDX de la licence.
uk: За тегом `SPDX-License-Identifier` слідує [дійсний вираз ліцензії SPDX](https://spdx.org/specifications), як правило, лише ідентифікатор ліцензії SPDX.

source: Each file must always contain these two tags in the header. You are allowed to use the tags multiple times if you have multiple copyright holders or licenses.
es: Cada archivo debe contener siempre estas dos etiquetas en la cabecera. Puede utilizar las etiquetas varias veces si tiene varios titulares de derechos de autor o licencias.
fr: Chaque fichier doit toujours contenir ces deux balises dans l'en-tête. Vous êtes autorisé à utiliser les balises plusieurs fois si vous avez plusieurs détenteurs de droits d'auteur ou licences.
uk: Кожен файл завжди повинен містити ці два теги в заголовку. Ви можете використовувати теги кілька разів, якщо у вас є кілька власників авторських прав або ліцензій.

source: In the example project, you also edit `Makefile` and `README.md` using this header information, but of course with corresponding comment syntax.
es: En el proyecto de ejemplo, también se edita `Makefile` y `README.md` utilizando esta información de cabecera, pero por supuesto con la correspondiente sintaxis de comentarios.
fr: Dans l'exemple de projet, vous modifiez également `Makefile` et `README.md` en utilisant ces informations d'en-tête, mais bien sûr avec la syntaxe de commentaire correspondante.
uk: У прикладі проєкту ви також редагуєте `Makefile` і `README.md`, використовуючи цю інформацію заголовка, але, звичайно, з відповідним синтаксисом коментарів.

source: The `reuse annotate` command helps with adding licensing and copyright information to your files. For the task above, the following command would do the job:
es: La orden `reuse annotate` ayuda a agregar información de licencia y derechos de autor a sus archivos. Para la tarea anterior, haría el trabajo la siguiente orden:
uk: Команда `reuse annotate` допомагає додавати відомості про ліцензії та авторські права до ваших файлів. Для завдання вище, така команда виконуватиме цю роботу:

source: reuse annotate --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-or-later" src/main.c Makefile README.md
es: reuse annotate --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-o-posterior" src/main.c Makefile README.md

source: Please see the [tool's documentation about annotate](https://reuse.readthedocs.io/en/stable/usage.html#annotate) for more options like comment styles and templates
es: Consulte la [documentación de la herramienta sobre annotate](https://reuse.readthedocs.io/en/stable/usage.html#annotate) para obtener más opciones, como estilos de comentarios y plantillas
uk: Перегляньте [документацію засобу про annotate](https://reuse.readthedocs.io/en/stable/usage.html#annotate), щоб дізнатися про додаткові опції, як-от стилі коментарів і шаблони

source: Binary and uncommentable files
es: Archivos binarios y no comentables
fr: Fichiers binaires et non commentables
uk: Двійкові та некоментовані файли

source: You also want to license your image files under GPL-3.0-or-later. Unfortunately, images and other binary files do not have comment headers that one can easily edit. Other examples include automatically generated files and certain data and configuration files for which comments are non-trivial.
es: También desea licenciar sus archivos de imagen bajo GPL-3.0 o posterior. Desafortunadamente, las imágenes y otros archivos binarios no tienen encabezados de comentarios que se puedan editar fácilmente. Otros ejemplos incluyen archivos generados automáticamente y ciertos datos y archivos de configuración para los cuales los comentarios no son triviales.
fr: Vous souhaitez également obtenir une licence pour vos fichiers image sous GPL-3.0-or-later. Malheureusement, les images et autres fichiers binaires n'ont pas d'en-tête de commentaire que l'on peut facilement modifier. D'autres exemples incluent des fichiers générés automatiquement et certains fichiers de données et de configuration pour lesquels les commentaires ne sont pas triviaux.
uk: Ви також хочете ліцензувати файли зображень під GPL-3.0 або новішої версії. На жаль, зображення та інші двійкові файли не мають заголовків коментарів, які можна легко редагувати. Інші приклади включають автоматично згенеровані файли та певні файли даних та конфігурації, коментарі до яких не нульові.

source: There is a simple trick to circumvent this. Create the files `cat.jpg.license` and `dog.jpg.license`, each containing the same information about license and copyright holder as above.
es: Hay un truco simple para eludir esto. Cree los archivos `cat.jpg.license` y `dog.jpg.license`, cada uno con la misma información sobre la licencia y el propietario de los derechos de autor que se indica arriba.
fr: Il existe une astuce simple pour contourner cela. Créez les fichiers `cat.jpg.license` et `dog.jpg.license`, chacun contenant les mêmes informations sur la licence et le détenteur des droits d'auteur que ci-dessus.
uk: Існує простий обхідний шлях. Створіть файли `cat.jpg.license` і `dog.jpg.license`, кожен з яких містить однакові відомості про ліцензію та власника авторських прав, як зазначено вище.

source: The REUSE helper tool should automatically detect binary files and therefore automatically create a corresponding `.license` file.
es: La herramienta de ayuda REUSE debería detectar automáticamente los archivos binarios y, por lo tanto, crear automáticamente el correspondiente archivo `.license`.
fr: L'outil d'assistance REUSE devrait détecter automatiquement les fichiers binaires et donc créer automatiquement un fichier `.license` correspondant.
uk: Допоміжний засіб REUSE повинен автоматично виявити двійкові файли та, отже, автоматично створити відповідний файл `.license`.

source: If it does not, or if you would like to enforce this, add the `--force-dot-license` argument to the annotate command. So the command for the above task may look like this:
es: Si no es así, o si desea aplicar esto, agregue el argumento `--explicit-license` al comando annotate. Entonces, la orden para la tarea anterior se puede ver así:
uk: Якщо цього не сталося, або якщо ви хочете примусово застосувати це, додайте аргумент `--force-dot-license` до команди annotate. Отже, команда для вищезазначеного завдання може мати такий вигляд:

source: reuse annotate --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-or-later" --force-dot-license img/cat.jpg img/dog.jpg
es: reuse annotate --copyright="Jane Doe <jane@example.com>" --license="GPL-3.0-o-posterior" --force-dot-license img/cat.jpg img/dog.jpg

source: Change licensing information
es: Cambiar información de licencia
fr: Modifier les informations de licence
uk: Змінити відомості про ліцензування

source: You discover that the photos of the cat and the dog were not licensed under the GPL at all, but under Creative Commons Attribution 4.0 International, owned by Max Mehl.
es: Descubre que las fotos del gato y el perro no tenían licencia GPL en absoluto, sino Creative Commons Attribution 4.0 International, propiedad de Max Mehl.
fr: Vous découvrez que les photos du chat et du chien n'étaient pas du tout sous licence GPL, mais sous Creative Commons Attribution 4.0 International, propriété de Max Mehl.
uk: Ви дізнаєтесь, що світлини кота та пса були ліцензовані зовсім не за GPL, а за ліцензією Creative Commons Attribution 4.0 International, що належить Максу Мелу.

source: The SPDX License Identifier of this license is CC-BY-4.0. You create the file `LICENSES/CC-BY-4.0.txt`, following the same steps you used for GPL-3.0-or-later.
es: El identificador de licencia SPDX de esta licencia es CC-BY-4.0. Cree el archivo `LICENSES/CC-BY-4.0.txt`, siguiendo los mismos pasos que usó para GPL-3.0 o posterior.
fr: L'identifiant de licence SPDX de cette licence est CC-BY-4.0. Vous créez le fichier `LICENSES/CC-BY-4.0.txt`, en suivant les mêmes étapes que vous avez utilisées pour GPL-3.0-or-later.
uk: Ідентифікатор ліцензії SPDX цієї ліцензії — CC-BY-4.0. Ви створюєте файл `LICENSES/CC-BY-4.0.txt`, дотримуючись тих самих кроків, які використовували для GPL-3.0-or-later.

source: You then edit `cat.jpg.license` and `dog.jpg.license` to say:
es: Después edite `cat.jpg.license` y `dog.jpg.license` para decir:
fr: Vous modifiez ensuite `cat.jpg.license` et `dog.jpg.license` pour dire :
uk: Потім ви редагуєте `cat.jpg.license` і `dog.jpg.license`, щоб сказати:

source: The tool as of now does not provide a way to replace existing REUSE-compliant copyright and licensing information. A run of the `annotate` command would not replace but extend the `.license` files with two additional lines stating the copyright of Max Mehl and the CC-BY-4.0 license. So you would have to update these manually.
es: La herramienta a partir de ahora no proporciona una forma de reemplazar la información existente de REUSE compatible de licencia y derechos de autor. Una ejecución del comando `annotate` no reemplazaría sino que ampliaría los archivos `.license` con dos líneas adicionales que indican los derechos de autor de Max Mehl y la licencia CC-BY-4.0. Por lo tanto, tendría que actualizarlos manualmente.
uk: Наразі засіб не надає способу заміни наявних відомостей про авторські права та ліцензування, сумісних з REUSE. Запуск команди `annotate` не замінить, а розширить файли `.license` двома додатковими рядками із зазначенням авторських прав Макса Мела та ліцензії CC-BY-4.0. Таким чином, вам потрібно оновити їх вручну.

source: However, the `download` command afterwards would allow you to download the new license automatically, so either with `reuse download CC-BY-4.0` or simply `reuse download --all`.
es: Sin embargo, el comando `download` permitirá descargar la nueva licencia automáticamente, así con `reuse download CC-BY-4.0` o simplemente `reuse download --all`.
fr: Cependant, la commande `download` par la suite vous permettrait de télécharger la nouvelle licence automatiquement, donc soit avec`reuse download CC-BY-4.0` ou simplement `reuse download --all`.
uk: Однак команда `download` згодом дозволить вам автоматично завантажити нову ліцензію або використавши `reuse download CC-BY-4.0`, або просто `reuse download --all`.

source: Build artifacts
es: Construir artefactos
fr: Artefacts de construction
uk: Створення технічних файлів

source: When you compile your program, you generate some build artifacts, such as `src/main.o`. You do not need to provide any licensing information for those files. Just use your `.gitignore` file to ignore these build artifacts. The REUSE tool will respect the contents of `.gitignore`.
es: Cuando compila su programa, genera algunos artefactos de compilación, como `src/main.o`. No necesita proporcionar ninguna información de licencia para esos archivos. Simplemente use su archivo `.gitignore` para ignorar estos artefactos de compilación. La herramienta REUSE respetará el contenido de `.gitignore`.
fr: Lorsque vous compilez votre programme, vous générez des artefacts de construction, tels que `src/main.o`. Vous n'avez pas besoin de fournir d'informations de licence pour ces fichiers. Utilisez simplement votre fichier `.gitignore` pour ignorer ces artefacts de construction. L'outil REUSE respectera le contenu de `.gitignore`.
uk: Під час компіляції програми створюються деякі технічні файли збірки, як-от `src/main.o`. Вам не потрібно вказувати будь-які відомості про ліцензування для цих файлів. Просто використовуйте файл `.gitignore`, щоб ігнорувати ці технічні файли збірки. Засіб REUSE зважатиме на вміст `.gitignore`.

source: Insignificant files
es: Archivos insignificantes
fr: Fichiers insignifiants
uk: Незначні файли

source: You probably will have files in your project that you do not find particularly copyrightable, for example configuration files such as `.gitignore`. Intuitively you may not want to license these files, but the fundamental idea of REUSE is that all your files will clearly have their copyright and licensing marked.
es: Probablemente tendrá archivos en su proyecto que no encuentre particularmente protegidos por derechos de autor, por ejemplo, archivos de configuración como `.gitignore`. Intuitivamente, es posible que no desee licenciar estos archivos, pero la idea fundamental de REUSE es que todos sus archivos tengan claramente marcados sus derechos de autor y licencia.
fr: Vous aurez probablement des fichiers dans votre projet que vous ne trouvez pas particulièrement protégés par le droit d'auteur, par exemple des fichiers de configuration tels que `.gitignore`. Intuitivement, vous ne voudrez peut-être pas octroyer une licence à ces fichiers, mais l'idée fondamentale de REUSE est que tous vos fichiers porteront clairement leur droit d'auteur et leur licence.
uk: Можливо, у вашому проєкті будуть файли, які ви не вважаєте за потрібне захищати авторським правом, наприклад, файли конфігурації, як-от `.gitignore`. Швидше за все ви не захочете ліцензувати ці файли, але основна ідея REUSE полягає в тому, що всі ваші файли, очевидно, матимуть зазначені авторські права та ліцензування.

source: If you do not exercise any copyright over this file, you can use the [CC0 license](https://creativecommons.org/publicdomain/zero/1.0/). This is functionally identical to putting the file in the public domain. Edit the file to contain:
es: Si no ejerce ningún derecho de autor sobre este archivo, puede utilizar la [licencia CC0](https://creativecommons.org/publicdomain/zero/1.0/). Esto es funcionalmente idéntico a poner el archivo en el dominio público. Edite el archivo para que contenga:
fr: Si vous n'exercez aucun droit d'auteur sur ce fichier, vous pouvez utiliser la [licence CC0](https://creativecommons.org/publicdomain/zero/1.0/). Ceci est fonctionnellement identique à placer le fichier dans le domaine public. Modifiez le fichier pour qu'il contienne :
uk: Якщо ви не використовуєте жодних авторських прав на цей файл, ви можете використовувати [ліцензію CC0](https://creativecommons.org/publicdomain/zero/1.0/). Це функціонально ідентично розміщенню файлу у відкритому доступі. Відредагуйте файл, щоб він містив:

source: Consequently, you will have to provide the CC0-1.0 license in the `LICENSES/` directory as well, just like the GPL-3.0-or-later and CC-BY-4.0 before.
es: En consecuencia, también deberá situar la licencia CC0-1.0 en el directorio `LICENSES/`, al igual que la GPL-3.0-o posterior y CC-BY-4.0 anterior.
fr: Par conséquent, vous devrez également fournir la licence CC0-1.0 dans le répertoire `LICENSES/`, tout comme la GPL-3.0-or-later et CC-BY-4.0 auparavant.
uk: Отже, вам доведеться надати ліцензію CC0-1.0 в каталозі `LICENSES/`, так само як раніше GPL-3.0-or-later і CC-BY-4.0.

source: More information about copyrightable files can be found in the [REUSE FAQ]({{< relref "faq.md#what-is-copyrightable" >}}).
es: Puede encontrar más información sobre los archivos protegidos por derechos de autor en [REUSE FAQ]({{< relref "faq.md#what-is-copyrightable" >}}).
fr: Pour plus d'informations sur les fichiers protégés par des droits d'auteur, consultez la [FAQ REUSE]({{< relref "faq.md#what-is-copyrightable" >}}).
uk: Докладніше про файли, захищені авторським правом, можна прочитати в розділі [ЧАП REUSE]({{< relref "faq.md#what-is-copyrightable" >}}).
