Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: As before, a combination of the `annotate` and `download` commands will fulfil the above step:
es: Como antes, una combinación de los comandos `annotate` y `download` cumplirá el paso anterior:
uk: Як і раніше, комбінація команд `annotate` and `download` виконає наведену раніше дію:

source: Result
es: Resultado
fr: Résultat
uk: Результат

source: Your project tree will now look like this:
es: Su árbol de proyecto ahora se verá así:
fr: L'arborescence de votre projet ressemblera maintenant à ceci :
uk: Ваше дерево проєкту тепер матиме такий вигляд:

source: Now that you have marked all files with their copyright and licensing, it is time to check whether you did not miss anything. To do this, we provide a helper tool for you to use. You can read the [full documentation](https://reuse.readthedocs.io/), or read the quick steps below.
es: Ahora que ha marcado todos los archivos con sus derechos de autor y licencias, es hora de verificar si no se perdió nada. Para hacer esto, proporcionamos una herramienta auxiliar para su uso. Puede leer la [documentación completa](https://reuse.readthedocs.io), o leer los pasos rápidos que se muestran a continuación.
fr: Maintenant que vous avez marqué tous les fichiers avec leurs droits d'auteur et licences, il est temps de vérifier si vous n'avez rien manqué. Pour ce faire, nous vous fournissons un outil d'aide à utiliser. Vous pouvez lire la [documentation complète](https://reuse.readthedocs.io/), ou lire les étapes rapides ci-dessous.
uk: Тепер, коли ви позначили всі файли їхніми авторськими правами та ліцензіями, настав час перевірити, чи нічого ви не пропустили. Для цього ми надаємо вам допоміжний засіб. Ви можете прочитати [всю документацію](https://reuse.readthedocs.io/) або прочитати про наведені далі дії.

source: Follow the [installation instructions](https://github.com/fsfe/reuse-tool#install) available for multiple platforms. Now go to the project directory and run the linter.
es: Siga las [instrucciones de instalación](https://github.com/fsfe/reuse-tool#install) disponibles para diferentes plataformas. Ahora vaya al directorio del proyecto y ejecute linter.
fr: Suivez les [instructions d'installation](https://github.com/fsfe/reuse-tool#install) disponibles pour plusieurs plates-formes. Allez maintenant dans le répertoire du projet et exécutez le linter.
uk: Дотримуйтесь [інструкцій з установлення](https://github.com/fsfe/reuse-tool#install), доступних для кількох платформ. Тепер перейдіть до каталогу проєкту і запустіть лінтер.

source: $ cd path/to/project/ $ reuse lint # SUMMARY * Bad licenses: * Deprecated licenses: * Licenses without file extension: * Missing licenses: * Unused licenses: * Used licenses: CC-BY-4.0, CC0-1.0, GPL-3.0-or-later * Read errors: 0 * Files with copyright information: 6 / 6 * Files with license information: 6 / 6 Congratulations! Your project is compliant with version 3.0 of the REUSE Specification :-)
es: $ cd path/to/project/ $ reuse lint # SUMMARY * Malas licencias: * Licencias obsoletas: * Licencias sin extensión de archivo: * Falta de licencias: * Licencias no utilizadas: * Licencias usadas: CC-BY-4.0, CC0-1.0, GPL-3.0-o-posterior * Leer errores: 0 * Archivos con información sobre derechos de autor: 6 / 6 * Archivos con información sobre licencias: 6 / 6 ¡Enhorabuena! Su proyecto cumple con la versión 3.0 de la especificación REUSE :-)
fr: $ cd chemin/vers/le/projet/ $ reuse lint # SUMMARY * Bad licenses: * Deprecated licenses: * Licenses without file extension: * Missing licenses: * Unused licenses: * Used licenses: CC-BY-4.0, CC0-1.0, GPL-3.0-or-later * Read errors: 0 * Files with copyright information: 6 / 6 * Files with license information: 6 / 6 Congratulations! Your project is compliant with version 3.0 of the REUSE Specification :-)

source: As you can see in the last line, the tool confirms that your project is compliant with REUSE now! To learn what the different sections mean, please have a look at the [documentation of the lint command](https://reuse.readthedocs.io/en/stable/usage.html#lint).
es: Como puede ver en la última línea, la herramienta confirma que su proyecto ya cumple con REUSE. Para saber qué significan las diferentes secciones, por favor, eche un vistazo a la [documentación del comando lint](https://reuse.readthedocs.io/en/stable/usage.html#lint).
fr: Comme vous pouvez le voir dans la dernière ligne, l'outil confirme que votre projet est maintenant conforme à REUSE ! Pour savoir ce que signifient les différentes sections, veuillez consulter la [documentation de la commande lint](https://reuse.readthedocs.io/en/stable/usage.html#lint).
uk: Як ви можете бачити в останньому рядку, засіб підтверджує, що ваш проєкт тепер сумісний із REUSE! Щоб дізнатися, що означають різні розділи, перегляньте [документацію команди lint](https://reuse.readthedocs.io/en/stable/usage.html#lint).

source: Getting help
es: Cómo obtener ayuda
fr: Obtenir de l'aide
uk: Довідка

source: After going through this tutorial, you understood REUSE and the three basic steps to properly license your software project – well done! But although we have covered a few edge cases, you might run into more questions soon. But don't worry, we are here to help!:
es: Después de pasar por este tutorial, ha entendido REUSE y los tres pasos básicos para licenciar adecuadamente su proyecto de software - ¡bien hecho! Pero aunque hemos cubierto algunos casos determinados, seguro que le surgirán más preguntas. Pero no se preocupe, ¡estamos aquí para ayudarle!:
fr: Après avoir parcouru ce tutoriel, vous avez compris REUSE et les trois étapes de base pour obtenir une licence correcte de votre projet logiciel – bravo ! Mais bien que nous ayons couvert quelques cas extrêmes, vous pourriez bientôt rencontrer d'autres questions. Mais ne vous inquiétez pas, nous sommes là pour vous aider ! :
uk: Прочитавши через цей посібник, ви зрозуміли як працює REUSE і три основні кроки, щоб правильно ліцензувати ваш програмний проєкт. чудово! Але хоч ми й розглянули кілька випадків, у вас може скоро виникнути більше питань. Але не хвилюйтеся, ми тут, щоб допомогти!:

source: - Our [Frequently Asked Questions](https://reuse.software/faq) covers common questions as well as extraordinary cases and will constantly be updated.
es: - Nuestras [Preguntas frecuentes] (https://reuse.software/faq) cubren preguntas comunes y casos extraordinarios y se actualizan constantemente.
fr: - Notre [Foire Aux Questions](https://reuse.software/faq) couvre les questions courantes ainsi que les cas extraordinaires et sera constamment mise à jour.
uk: – Наші [Поширені запитання](https://reuse.software/faq) охоплюють типові запитання, а також надзвичайні випадки, і вони постійно оновлюватимуться.

source: - The full [REUSE specification](https://reuse.software/spec) formally describes REUSE and the methods to become compliant.
es: - [REUSE specification](https://reuse.software/spec) describe formalmente REUSE y los métodos para llegar.
fr: - La [spécification REUSE complète](https://reuse.software/spec) décrit formellement REUSE et les méthodes pour devenir conforme.
uk: - Повна [специфікація REUSE](https://reuse.software/spec) формально описує REUSE та методи досягнення сумісності.

source: The [REUSE tool documentation](https://reuse.readthedocs.io/) describes installation and usage of the REUSE tool.
es: La [documentación de la herramienta REUSE] (https://reuse.readthedocs.io/) describe la instalación y el uso de la herramienta REUSE.
fr: La [documentation de l'outil REUSE](https://reuse.readthedocs.io/) décrit l'installation et l'utilisation de l'outil REUSE.
uk: У [документації до засобу REUSE](https://reuse.readthedocs.io/) описано як установити та користуватися засобом REUSE.

source: Our [help for developers](https://reuse.software/dev/) lists various resources for programmers like the tool, the API, or how to include checks in CI/CD workflows.
es: Nuestra [ayuda para desarrolladores](https://reuse.software/dev/) enumera varios recursos para los programadores, como la herramienta, la API o cómo incluir comprobaciones en los flujos de trabajo de CI/CD.
fr: Notre [aide aux développeurs](https://reuse.software/dev/) répertorie diverses ressources pour les programmeurs comme l'outil, l'API ou comment inclure des vérifications dans les flux de travail CI/CD.
uk: У нашій [довідці для розробників](https://reuse.software/dev/) перелічено різні ресурси для програмістів, як-от інструменти, API або те, як включити перевірки в робочі процеси CI/CD.

source: If none of the links above were able to answer your question, please contact us by:
es: Si ninguno de los enlaces anteriores pudo responder a su pregunta, comuníquese con nosotros a través de:
fr: Si aucun des liens ci-dessus ne répond à votre question, veuillez nous contacter par :
uk: Якщо жодне з наведених посилань не відповідає на ваше запитання, зв'яжіться з нами за допомогою:

source: opening an issue on [reuse-docs](https://github.com/fsfe/reuse-docs) for questions on the tutorial, FAQ or specification;
es: abriendo una consulta en [reuse-docs](https://github.com/fsfe/reuse-docs) para preguntas en el tutorial, FAQ o especificaciones;
fr: ouvrir une issue sur [reuse-docs](https://github.com/fsfe/reuse-docs) pour des questions sur le tutoriel, la FAQ ou la spécification ;
uk: відкриття обговорення на [reuse-docs](https://github.com/fsfe/reuse-docs) для запитань щодо посібника, поширених запитань або специфікації;

source: opening an issue on [reuse-tool](https://github.com/fsfe/reuse-tool) for questions on the REUSE tool;
es: abriendo una consulta en [reuse-tool](https://github.com/fsfe/reuse-tool) para preguntas sobre la herramienta REUSE;
fr: ouverture d'une issue sur [reuse-tool](https://github.com/fsfe/reuse-tool) pour des questions sur l'outil REUSE ;
uk: відкриття обговорення на [reuse-tool](https://github.com/fsfe/reuse-tool) для запитань про засіб REUSE;

source: or [sending an email to the FSFE](https://fsfe.org/contact). Please note that we would prefer issues because they are publicly searchable for other people.
es: o [enviando un correo electrónico a la FSFE](https://fsfe.org/contact). Tenga en cuenta que preferimos las consultas porque las pueden ver públicamente otras personas.
fr: ou [envoi d'un e-mail à la FSFE](https://fsfe.org/contact). Veuillez noter que nous préférerions les issues car elles peuvent être recherchées publiquement pour d'autres personnes.
uk: або [надіславши електронного листа до FSFE](https://fsfe.org/contact). Зауважте, що ми надаємо перевагу обговоренням, оскільки вони доступні для загального пошуку для інших людей.

source: Thank you for your valuable contribution towards making software reusable!
es: ¡Gracias por su valiosa contribución para hacer que el software sea reutilizable!
fr: Merci pour votre précieuse contribution à la réutilisation des logiciels !
uk: Дякуємо вам за ваш цінний внесок у створення програмного забезпечення для повторного використання!

source: General {#general}
fr: Général {#general}
uk: Загальне {#general}

source: The `reuse addheader` command helps with adding licensing and copyright information to your files. For the task above, the following command would do the job:
fr: La commande `reuse addheader` aide à ajouter des informations de licence et de droit d'auteur à vos fichiers. Pour la tâche ci-dessus, la commande suivante ferait le travail :

source: Please see the [tool's documentation about addheader](https://reuse.readthedocs.io/en/stable/usage.html#addheader) for more options like comment styles and templates
fr: Veuillez consulter la [documentation de l'outil sur addheader](https://reuse.readthedocs.io/en/stable/usage.html#addheader) pour plus d'options comme les styles de commentaires et les modèles

source: If it does not, or if you would like to enforce this, add the `--explicit-license` argument to the addheader command. So the command for the above task may look like this:
fr: Si ce n'est pas le cas, ou si vous souhaitez appliquer cela, ajoutez l'argument `--explicit-license` à la commande addheader. Ainsi, la commande pour la tâche ci-dessus peut ressembler à ceci :

source: The tool as of now does not provide a way to replace existing REUSE-compliant copyright and licensing information. A run of the `addheader` command would not replace but extend the `.license` files with two additional lines stating the copyright of Max Mehl and the CC-BY-4.0 license. So you would have to update these manually.
fr: À l'heure actuelle, l'outil ne permet pas de remplacer les informations de copyright et de licence existantes conformes à REUSE. Une exécution de la commande `addheader` ne remplacerait pas mais étendrait les fichiers `.license` avec deux lignes supplémentaires indiquant le copyright de Max Mehl et la licence CC-BY-4.0. Vous devrez donc les mettre à jour manuellement.

source: As before, a combination of the `addheader` and `download` commands will fulfil the above step:
fr: Comme précédemment, une combinaison des commandes `addheader` et `download` remplira l'étape ci-dessus :
