Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: Yes. This may seem extraneous, but it prevents future confusion when differently licensed code is adopted. By keeping all licenses in a single directory, it is easy for a user of your program to find all the licenses they need to comply with in the blink of an eye.
es: Sí. Esto puede parecer extraño, pero evita futuras confusiones cuando se adopta un código de licencia diferente. Al mantener todas las licencias en un solo directorio, es fácil para un usuario de su programa encontrar todas las licencias que necesita para cumplir en un abrir y cerrar de ojos.
fr: Oui. Cela peut sembler étrange, mais cela évite toute confusion future lorsqu'un code sous licence différente est adopté. En conservant toutes les licences dans un seul répertoire, il est facile pour un utilisateur de votre programme de trouver toutes les licences dont il a besoin pour s'y conformer en un clin d'œil.
uk: Так. Це може здатися зайвим, але це запобігає плутанині в майбутньому, коли приймається код під іншою ліцензією. Зберігаючи всі ліцензії в одному каталозі, користувачеві вашої програми легко знайти всі ліцензії, яких вони одночасно повинні дотримуватися.

source: Should I put comment headers in my license files? {#header-in-license}
es: ¿Debo poner encabezados de comentarios en mis archivos de licencia? {#header-in-license}
fr: Dois-je mettre des en-têtes de commentaires dans mes fichiers de licence ? {#header-in-license}
uk: Чи слід класти заголовки коментарів у файли ліцензій? {#header-in-license}

source: You should not edit license files. Please see [this question](#edit-license).
es: No debe editar los archivos de licencia. Por favor vea [esta pregunta](#edit-license).
fr: Vous ne devez pas modifier les fichiers de licence. Veuillez consulter [cette question](#edit-license).
uk: Не слід редагувати файли ліцензій. Перегляньте [це питання](#edit-license).

source: How do I use a license that is not on the SPDX License List? {#custom-license}
es: ¿Cómo uso una licencia que no está en la lista de licencias de SPDX? {#custom-license}
fr: Comment utiliser une licence qui ne figure pas dans la liste des licences SPDX ? {#custom-license}
uk: Як використовувати ліцензію, якої немає у списку ліцензій SPDX? {#custom-license}

source: <!-- TODO: Explain that the user probably shouldn't use a custom license -->
es: <!-- TODO: Explicar que el usuario probablemente no debería usar una licencia personalizada -->
fr: <!-- TODO: Expliquer que l'utilisateur ne devrait probablement pas utiliser de licence personnalisée -->

source: If you have a custom or modified license that does not appear in the SPDX License List, place your license in the file `LICENSES/LicenseRef-MyLicense.txt`. By naming your license as such, tools that speak SPDX will still be able to recognise your license.
es: Si tiene una licencia personalizada o modificada que no aparece en la Lista de licencias de SPDX, coloque su licencia en el archivo `LICENSES/LicenseRef-MyLicense.txt`. Al nombrar su licencia como tal, las herramientas que leen SPDX aún podrán reconocer su licencia.
fr: Si vous disposez d'une licence personnalisée ou modifiée qui n'apparaît pas dans la liste des licences SPDX, placez votre licence dans le fichier `LICENSES/LicenseRef-MyLicense.txt`. En nommant votre licence en tant que telle, les outils qui parlent SPDX pourront toujours reconnaître votre licence.
uk: Якщо у вас є власна або модифікована ліцензія, відсутня у списку ліцензій SPDX, розмістіть ліцензію у файлі `LICENSES/LicenseRef-MyLicense.txt`. Називаючи ліцензію як таку, інструменти, які обробляють SPDX, все одно зможуть розпізнати вашу ліцензію.

source: How do I use a custom exception? {#custom-exception}
es: ¿Cómo utilizo una excepción personalizada? {#custom-exception}
fr: Comment utiliser une exception personnalisée ? {#custom-exception}
uk: Як використовувати власний виняток? {#custom-exception}

source: It is not possible to create a custom exception. Instead, you may [create a custom license](#custom-license) that embeds the exception.
es: No es posible crear una excepción personalizada. En su lugar, puede [crear una licencia personalizada](#custom-license) que incorpore la excepción.
fr: Il n'est pas possible de créer une exception personnalisée. Au lieu de cela, vous pouvez [créer une licence personnalisée](#custom-license) qui intègre l'exception.
uk: Неможливо створити власний виняток. Замість цього ви можете [створити власну ліцензію](#custom-license), яка вбудовує виняток.

source: Should I edit my license files? {#edit-license}
es: ¿Debo editar mis archivos de licencia? {#edit-license}
fr: Dois-je modifier mes fichiers de licence ? {#edit-license}
uk: Чи потрібно редагувати файли ліцензії? {#edit-license}

source: You should never edit license files. When you use an existing license, you should always copy it verbatim.
es: Nunca debe editar los archivos de licencia. Cuando utilice una licencia existente, siempre debe copiarla al pie de la letra.
fr: Vous ne devez jamais modifier les fichiers de licence. Lorsque vous utilisez une licence existante, vous devez toujours la copier textuellement.
uk: Ніколи не редагуйте файли ліцензій. Коли ви використовуєте чинну ліцензію, ви завжди повинні копіювати її дослівно.

source: <!-- TODO: the linked section still needs to be written. Some licenses, such as MIT and the BSD family of licenses, have a line that says "Copyright (c) [year] [copyright holder]". Please see [this question](#mit-bsd) about how to deal with those licenses. -->
es: <!-- TODO: la sección vinculada aún debe escribirse. Algunas licencias, como MIT y la familia de licencias BSD, tienen una línea que dice "Copyright (c) [year] [copyright holder]". Consulte [esta pregunta](#mit-bsd) sobre cómo usar esas licencias. -->

source: There are many reasons for why you should not alter license texts, but if you do alter the texts, you should use a different SPDX identifier for this license. See [the previous question](#custom-license).
es: Hay muchas razones por las que no debe modificar los textos de las licencias, pero si modifica los textos, debe utilizar un identificador SPDX diferente para esta licencia. Ver [la pregunta anterior](#custom-license).
fr: Il existe de nombreuses raisons pour lesquelles vous ne devez pas modifier les textes de licence, mais si vous modifiez les textes, vous devez utiliser un identifiant SPDX différent pour cette licence. Voir [la question précédente](#custom-license).
uk: Існує багато причин, чому ви не повинні змінювати тексти ліцензій, але якщо ви змінюєте тексти, вам слід використовувати інший ідентифікатор SPDX для цієї ліцензії. ДиЧитайте [попереднє запитання](#custom-license).

source: Can I edit copyright notices and license disclaimers? {#edit-copyright-and-licensing}
es: ¿Puedo editar avisos de derechos de autor y renuncias de licencia?{#edit-copyright-and-licensing}
fr: Puis-je modifier les avis de droits d'auteur et les clauses de non-responsabilité ? {#edit-copyright-and-licensing}
uk: Чи можна редагувати повідомлення про авторські права та відмову від відповідальності? {#edit-copyright-and-licensing}

source: If you find out that some information is incorrect, you are free to adjust it. Otherwise, it is usually a good idea to leave copyright notices and license disclaimers intact. But there is no one-size-fits-all answer here.
es: Si descubre que alguna información es incorrecta, es libre de corregirla. De lo contrario, suele ser una buena idea dejar intactos las notas de derechos de autor y las renuncias de licencia. Pero no hay una respuesta única para todo.
fr: Si vous découvrez que certaines informations sont incorrectes, vous êtes libre de les ajuster. Sinon, il est généralement judicieux de laisser intactes les avis de droits d'auteur et les clauses de non-responsabilité des licences. Mais il n'y a pas de réponse unique ici.
uk: Якщо ви виявите, що якісь відомості неправильні, ви можете доповнити їх. В іншому випадку, як правило, краще лишити повідомлення про авторські права та ліцензії відмови від відповідальності недоторканими. Але тут немає єдиної відповіді.

source: Can I remove the license and copyright information from minified code (e.g., JavaScript)? {#minified}
es: ¿Puedo eliminar la licencia y la información de derechos de autor del código minimizado (por ejemplo, JavaScript)? {#minified}
fr: Puis-je supprimer les informations de licence et de droit d'auteur du code minifié (par exemple, JavaScript) ? {#minified}
uk: Чи можу я вилучити ліцензію та відомості про авторські права з мініфікованого коду (наприклад, JavaScript)? {#minified}

source: You can, but you probably should not. Many minifiers have an option that allows you to retain the header comment. If this option is present, you should use it, especially if you use a license that mandates that you include a license disclaimer.
es: Puede, pero probablemente no debería. Muchos minificadores tienen una opción que permite conservar el comentario del encabezado. Si se presenta esta opción, debe usarla, especialmente si usa una licencia que exige que incluya un descargo de responsabilidad de la licencia.
fr: Vous pouvez, mais vous ne devriez probablement pas. De nombreux minificateurs ont une option qui vous permet de conserver le commentaire d'en-tête. Si cette option est présente, vous devez l'utiliser, en particulier si vous utilisez une licence qui vous oblige à inclure une clause de non-responsabilité de licence.
uk: Ви можете, але, ймовірно, не потрібно. Багато мініфікаторів мають опцію, яка дає змогу зберегти коментар заголовка. Якщо цей параметр присутній, його слід використовувати, особливо якщо ви використовуєте ліцензію, яка передбачає включення відмови від відповідальності за ліцензію.

source: For lawyers and legal experts {#lawyers}
es: Para abogados y asesores legales {#lawyers}
fr: Pour les avocats et les juristes {#lawyers}
uk: Для юристів та фахівців з права {#lawyers}

source: I am a lawyer and want a bill of materials {#bill-of-materials}
es: Soy abogado y quiero una lista de materiales {#bill-of-materials}
fr: Je suis avocat et je veux une nomenclature {#bill-of-materials}
uk: Я правник і хочу отримати перелік матеріалів {#bill-of-materials}

source: Install the reuse tool and run `reuse spdx -o reuse.spdx` in the project root to create an [SPDX document](https://spdx.org/spdx-specification-21-web-version).
es: Instale la herramienta reuse y ejecute `reuse spdx -o reuse.spdx` en la raíz del proyecto para crear un [documento SPDX](https://spdx.org/spdx-specification-21-web-version).
fr: Installez l'outil reuse et exécutez `reuse spdx -o reuse.spdx` à la racine du projet pour créer un [document SPDX](https://spdx.org/spdx-specification-21-web-version).
uk: Установіть засіб reuse та запустіть `reuse spdx -o reuse.spdx` у кореневому каталозі проєкту, щоб створити [документ SPDX](https://spdx.org/spdx-specification-21-web-version).

source: REUSE Specification – Version 3.0
es: Especificación REUSE – Versión 3.0
fr: Spécification REUSE – Version 3.0
uk: Специфікація REUSE – версія 3.0

source: This specification defines a standardized method for declaring copyright and licensing for software projects. The goal of the specification is to have unambiguous, human- and machine-readable copyright and licensing information for each individual file in a project. Ideally this information is embedded into every file, so that the information is preserved when the file is copied and reused by third parties.
es: Esta especificación define un método estandarizado para declarar derechos de autor y licencias para proyectos de software. El objetivo de la especificación es tener información de derechos de autor y licencias inequívocas, legible por humanos y máquinas para cada archivo individual en un proyecto. Idealmente, esta información está incrustada en cada archivo, de modo que la información se conserve cuando el archivo sea copiado y reutilizado por terceros.
fr: Cette spécification définit une méthode normalisée pour déclarer les droits d'auteur et les licences pour les projets logiciels. Le but de la spécification est de disposer d'informations sur les droits d'auteur et les licences non ambiguës, lisibles par l'homme et la machine pour chaque fichier individuel d'un projet. Idéalement, ces informations sont intégrées dans chaque fichier, de sorte que les informations soient conservées lorsque le fichier est copié et réutilisé par des tiers.
uk: Ця специфікація визначає стандартизований метод оголошення авторських прав і ліцензування для програмних проєктів. Мета специфікації полягає в тому, щоб мати однозначну, людино- і машинозчитувану інформацію про авторські права та ліцензування для кожного окремого файлу в проєкті. В ідеалі ця інформація вбудована в кожен файл, так що інформація зберігається при копіюванні файлу і повторному їх використанні третіми особами.

source: This specification implements [IETF RFC 2119: Key words for use in RFCs to Indicate Requirement Levels](https://tools.ietf.org/html/rfc2119).
es: Esta especificación implementa [IETF RFC 2119: palabras clave para usar en RFC e indicar los Requirement Levels](https://tools.ietf.org/html/rfc2119).
fr: Cette spécification implémente [IETF RFC 2119 : Mots clés à utiliser dans les RFC pour indiquer les niveaux d'exigence](https://tools.ietf.org/html/rfc2119).
uk: Ця специфікація впроваджує [IETF RFC 2119: Ключові слова для вживання у RFC для вказання рівнів вимог](https://tools.ietf.org/html/rfc2119).

source: For the revision history of this specification, please see [the change log](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).
es: Para ver el historial de revisiones de esta especificación, consulte [el registro de cambios](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).
fr: Pour l'historique des révisions de cette spécification, veuillez consulter [le journal des modifications](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).
uk: Історію редакцій цієї специфікації перегляньте у [журналі змін](https://git.fsfe.org/reuse/docs/src/branch/master/CHANGELOG.md).

source: Definitions
es: Definiciones
fr: Définitions
uk: Визначення

source: These are the definitions for some of the terms used in this specification:
es: Estas son las definiciones de algunos de los términos utilizados en esta especificación:
fr: Voici les définitions de certains des termes utilisés dans cette spécification :
uk: Ось визначення деяких термінів, що використовуються в цій специфікації:

source: Project --- any unit of content that can be associated with a distribution of software. Typically, a Project is composed of one or more files. Also sometimes called a package.
es: Proyecto: cualquier unidad de contenido que pueda asociarse a una distribución de software. Normalmente, un Proyecto se compone de uno o más archivos. También se denomina a veces paquete.
fr: Projet --- toute unité de contenu pouvant être associée à une distribution de logiciel. En règle générale, un projet est composé d'un ou plusieurs fichiers. Aussi parfois appelé un package.
uk: Проєкт — будь-яка одиниця вмісту, яка може бути пов'язана з розповсюдженням програмного забезпечення. Як правило, проєкт складається з одного або кількох файлів. Також іноді називають пакунком.

source: - License File --- a file containing the text of a license.
es: - Archivo de licencia --- un archivo que contiene el texto de una licencia.
fr: - Fichier de licence --- un fichier contenant le texte d'une licence.
uk: - Файл ліцензії --- файл, що містить текст ліцензії.

source: Copyright and Licensing Information --- the information that lists the copyright holders of a file or work, and describes under which licenses the file or work is made available.
es: Información sobre derechos de autor y licencias --- la información que enumera los titulares de los derechos de autor de un archivo o trabajo, y describe bajo qué licencias está disponible el archivo o trabajo.
fr: Informations sur les droits d'auteur et les licences --- les informations qui répertorient les détenteurs de droits d'auteur d'un fichier ou d'une œuvre et décrivent sous quelles licences le fichier ou l'œuvre est mis à disposition.
uk: Інформація про авторське право та ліцензування — інформація, в якій перелічено власників авторських прав на файл або роботу, і описано, за якими ліцензіями доступні файл або робота.

source: SPDX Specification --- SPDX specification, version 2.1; as available on <https://spdx.org/specifications>.
es: SPDX Specification --- SPDX specification, versión 2.1; disponible en <https://spdx.org/specifications>.
fr: Spécification SPDX --- Spécification SPDX, version 2.1 ; disponible sur <https://spdx.org/specifications>.
uk: Специфікація SPDX — специфікація SPDX, версія 2.1; доступна на <https://spdx.org/specifications>.

source: SPDX License Identifier --- SPDX short-form identifier, as defined in SPDX Specification. See also <https://spdx.org/ids> for a short introduction and examples.
es: Identificador de licencia SPDX --- Identificador abreviado de SPDX, tal como se define en SPDX Specification. Véase también <https://spdx.org/ids> para una breve introducción y ejemplos.
fr: Identificateur de licence SPDX --- Identificateur de forme courte SPDX, tel que défini dans la spécification SPDX. Voir également <https://spdx.org/ids> pour une brève introduction et des exemples.
uk: Ідентифікатор ліцензії SPDX — ідентифікатор короткої форми SPDX, як визначено у специфікації SPDX. Перегляньте також <https://spdx.org/ids> для швидкого ознайомлення та прикладів.

source: - SPDX License Expression --- as defined in SPDX Specification, Appendix IV, at <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.
es: - SPDX License Expression --- como se define en SPDX Specification, Appendix IV, en <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.
fr: - Expression de licence SPDX --- telle que définie dans la spécification SPDX, Annexe IV, à <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.
uk: - Вираз ліцензії SPDX — як визначено в специфікації SPDX, Додаток IV, за адресою <https://spdx.org/spdx-specification-21-web-version#h.jxpfx0ykyb60>.

source: SPDX License List --- a list of commonly found licenses and exceptions; as available on <https://spdx.org/licenses/>.
es: SPDX License List --- una lista de las licencias y excepciones más comunes; disponible en <https://spdx.org/licenses/>.
fr: Liste des licences SPDX --- une liste des licences et exceptions les plus courantes; disponible sur <https://spdx.org/licenses/>.
uk: Список ліцензій SPDX — список поширених ліцензій і винятків; доступний на <https://spdx.org/licenses/>.

source: DEP5 --- [Machine-readable `debian/copyright` file, Version 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Where the REUSE Specification and DEP5 state different things, the REUSE Specification takes precedence. Specifically in the case of the `Copyright` and `License` tags.
es: DEP5 --- [Machine-readable `debian/copyright` file, Version 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Cuando la Especificación REUSE y la DEP5 establecen cosas diferentes, la Especificación REUSE tiene prioridad. En concreto, en el caso de las etiquetas `Copyright` y `License`..
fr: DEP5 --- [fichier `debian/copyright` lisible par machine, version 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Lorsque la spécification REUSE et DEP5 indiquent des choses différentes, la spécification REUSE a la priorité. Plus précisément dans le cas des balises `Copyright` et `License`.
uk: DEP5 — [Машинозчитуваний `debian/copyright`, версія 1.0](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/). Якщо специфікація REUSE та DEP5 мають розбіжності, специфікація REUSE має пріоритет. Зокрема, у випадку з тегами `Copyright` і `License`.

source: REUSE Tool --- helper tool for compliance with this Specification; available at <https://github.com/fsfe/reuse-tool>.
es: REUSE Tool --- herramienta de ayuda para el cumplimiento de esta Especificación; disponible en <https://github.com/fsfe/reuse-tool>.
fr: Outil REUSE --- outil d'aide pour la conformité à cette spécification ; disponible sur <https://github.com/fsfe/reuse-tool>.
uk: Інструмент REUSE — допоміжний інструмент для дотримання цієї специфікації; доступний на <https://github.com/fsfe/reuse-tool>.

source: License files
es: Archivos de licencia
fr: Fichiers de licence
uk: Файли ліцензій

source: A Project MUST include a License File for every license under which files in the Project are licensed.
es: Un Proyecto DEBE incluir un Archivo de Licencia para cada licencia bajo la cual los archivos del Proyecto están licenciados.
fr: Un projet DOIT inclure un fichier de licence pour chaque licence sous laquelle les fichiers du projet sont concédés.
uk: Проєкт ПОВИНЕН включати файл ліцензії для кожної ліцензії, за якою ліцензуються файли в Проєкті.

source: Each License File MUST be placed in the `LICENSES/` directory in the root of the Project. The name of the License File MUST be the SPDX License Identifier of the license followed by an appropriate file extension (example: `LICENSES/GPL-3.0-or-later.txt`). The License File MUST be in plain text format.
es: Cada Archivo de Licencia DEBE colocarse en el directorio `LICENSES/` en la raíz del proyecto. El nombre del Archivo de Licencia DEBE ser el identificador de Licencia SPDX de la licencia seguido de una extensión de archivo adecuada (por ejemplo: `LICENSES/GPL-3.0-or-later.txt`). El archivo de licencia DEBE estar en formato de texto sin formato.
fr: Chaque fichier de licence DOIT être placé dans le répertoire `LICENSES/` à la racine du projet. Le nom du fichier de licence DOIT être l'identifiant de licence SPDX de la licence suivi d'une extension de fichier appropriée (exemple : `LICENSES/GPL-3.0-or-later.txt`). Le fichier de licence DOIT être au format texte brut.
uk: Кожен файл ліцензії повинен бути розміщений у каталозі `LICENSES/` у кореневому каталозі проєкту. Назва файлу ліцензії ПОВИННА бути ідентифікатором ліцензії SPDX, а потім відповідним розширенням файлу (наприклад: `LICENSES/GPL-3.0-or-later.txt`). Файл ліцензії ПОВИНЕН бути у звичайному текстовому форматі.

source: If a license does not exist in the SPDX License List, its SPDX License Identifier MUST be `LicenseRef-[idstring]` as defined by the SPDX Specification, Section 6 available at <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.
es: Si no aparece una licencia en la Lista de licencias SPDX, su Identificador de licencia SPDX DEBE ser `LicenseRef-[idstring]` tal como se define en la Especificación SPDX, Sección 6 disponible en <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.
fr: Si une licence n'existe pas dans la liste des licences SPDX, son identifiant de licence SPDX DOIT être `LicenseRef-[idstring]` tel que défini par la spécification SPDX, section 6 disponible sur <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.
uk: Якщо ліцензії немає у списку ліцензій SPDX, її ідентифікатор ліцензії SPDX ПОВИНЕН бути `LicenseRef-[idstring]`, як визначено специфікацією SPDX, у розділі 6, доступному на <https://spdx.org/spdx-specification-21-web-version#h.1v1yuxt>.

source: A Project MUST NOT include License Files for licenses under which none of the files in the Project are licensed.
es: Un Proyecto NO DEBE incluir Archivos de Licencia para licencias bajo las cuales ninguno de los archivos del Proyecto tiene licencia.
fr: Un projet NE DOIT PAS inclure de fichiers de licence pour les licences sous lesquelles aucun des fichiers du projet n'est concédé.
uk: Проєкт НЕ ПОВИНЕН містити файли ліцензій для ліцензій, за якими не ліцензований жоден із файлів у проєкті.
