Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: Frequently Asked Questions
es: Preguntas frecuentes
fr: Foire Aux Questions
uk: Часті запитання

source: {{< toc >}}
es: {{< tocado >}}

source: I am short on time. Can you give me the quickest possible summary? {#quick-summary}
es: Tengo poco tiempo. ¿Puedes hacerme un resumen lo más rápido posible? {#resumen-rápido}
fr: Je manque de temps. Pouvez-vous me donner le résumé le plus rapide possible ? {#quick-summary}
uk: Мені не вистачає часу. Чи можете ви дати мені якнайшвидші підсумки? {#quick-summary}

source: We want to improve the way that people license their software projects. We propose three steps to achieve this:
es: Queremos mejorar la forma en que la gente licencia sus proyectos de software. Proponemos tres pasos para lograrlo:
fr: Nous voulons améliorer la façon dont les gens obtiennent des licences pour leurs projets logiciels. Nous proposons trois étapes pour y parvenir :
uk: Ми хочемо поліпшити те, як люди ліцензують свої програмні проєкти. Ми пропонуємо три кроки для досягнення цього:

source: 1. Choose and provide licenses {#step-1}
es: 1. Elegir y proporcionar licencias {#step-1}
fr: 1. Choisir et fournir des licences {#step-1}
uk: 1. Виберіть і надайте ліцензії {#step-1}

source: Choose a [Free Software](https://fsfe.org/about/basics/freesoftware) license for your project. Find the SPDX identifier of your license in the [SPDX License List](https://spdx.org/licenses/). Download the license text for your license from the [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) repository and put it in the `LICENSES/` directory.
es: Elija una licencia de [Software Libre](https://fsfe.org/about/basics/freesoftware) para su proyecto. Encuentre el identificador SPDX de su licencia en la [Lista de licencias SPDX](https://spdx.org/licenses/). Descargue el texto de su licencia del repositorio [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) y colóquelo en el directorio `LICENSES/`.
fr: Choisissez une licence [Logiciel libre](https://fsfe.org/about/basics/freesoftware) pour votre projet. Recherchez l'identifiant SPDX de votre licence dans la [Liste des licences SPDX](https://spdx.org/licenses/). Téléchargez le texte de la licence pour votre licence à partir du référentiel [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) et placez-le dans le répertoire `LICENSES/` .
uk: Оберіть ліцензію [Free Software](https://fsfe.org/about/basics/freesoftware) для вашого проєкту. Знайдіть ідентифікатор SPDX вашої ліцензії в [списку ліцензії SPDX](https://spdx.org/licenses/). Завантажте текст ліцензії на вашу ліцензію з репозиторію [license-list-data](https://github.com/spdx/license-list-data/tree/master/text) і покладіть її у каталог `LICENSES/`.

source: 2. Add copyright and licensing information to each file {#step-2}
es: 2. Añada la información sobre derechos de autor y licencias a cada archivo {#paso-2}
fr: 2. Ajouter des informations sur les droits d'auteur et les licences à chaque fichier {#step-2}
uk: 2. Додайте відомості про авторські права та ліцензування до кожного файлу {#step-2}

source: Then, for all files, edit the header to contain the following:
es: Luego, para todos los archivos, edite el encabezado para que contenga lo siguiente:
fr: Ensuite, pour tous les fichiers, modifiez l'en-tête pour qu'il contienne les éléments suivants :
uk: Потім для всіх файлів змініть заголовок, щоб він містив таке:

source: # SPDX-FileCopyrightText: [year] [copyright holder] <[email address]> # # SPDX-License-Identifier: [identifier]
es: # SPDX-FileCopyrightText: [año] [titular de los derechos de autor] <[dirección de correo electrónico]> # # SPDX-License-Identifier: [identificador]
fr: # SPDX-FileCopyrightText : [année] [copyright holder] <[adresse mail]> # # SPDX-License-Identifier : [identifiant]

source: 3. Confirm REUSE compliance {#step-3}
es: 3. Confirmar el cumplimiento de REUSE {#step-3}
fr: 3. Confirmer la conformité REUSE {#step-3}
uk: 3. Підтвердьте відповідність повторного використання {#step-3}

source: Use the [REUSE tool](https://github.com/fsfe/reuse-tool) to automate some of these steps, and to check whether you did everything correctly.
es: Utilice la [herramienta REUSE](https://github.com/fsfe/reuse-tool) para automatizar algunos de estos pasos y comprobar si lo ha hecho todo correctamente.
fr: Utilisez l'[outil REUSE](https://github.com/fsfe/reuse-tool) pour automatiser certaines de ces étapes et pour vérifier si vous avez tout fait correctement.
uk: Використовуйте [засіб REUSE](https://github.com/fsfe/reuse-tool) щоб автоматизувати деякі з цих кроків, і перевірити, чи ви зробили все правильно.

source: What is copyright? {#what-is-copyright}
es: ¿Qué son los derechos de autor? {#what-is-copyright}
fr: Qu'est-ce que le droit d'auteur ? {#what-is-copyright}
uk: Що таке авторські права? {#what-is-copyright}

source: Copyright is a legal construct that grants someone exclusive rights over a creative work. The most important exclusive right is in the name: The right to produce copies. Only the copyright holder is allowed to give new copies of their work to people.
es: Los derechos de autor son una construcción legal que otorga a alguien derechos exclusivos sobre un trabajo creativo. El derecho exclusivo más importante está en el nombre: El derecho a producir copias Copyright. Solo el titular de los derechos de autor puede repartir nuevas copias de su trabajo.
fr: Le droit d'auteur est une construction juridique qui accorde à une personne des droits exclusifs sur une œuvre de création. Le droit exclusif le plus important est dans le nom : Le droit de produire des copies. Seul le titulaire du droit d'auteur est autorisé à donner de nouvelles copies de son travail aux gens.
uk: Авторське право — це елемент права, який надає комусь ексклюзивні права на доробок. Найважливіше ексклюзивне право — у назві: Право на виготовлення копій. Лише власник авторських прав може передавати людям нові копії своїх творів.

source: Usually the author is the copyright holder, but often copyright is transferred to the author's employer. In most places, you do not need to do anything to gain copyright. As soon as you make a creative work, you (or your employer) instantly gain copyright over it.
es: Por lo general, el autor es el titular de los derechos de autor, pero a menudo los derechos de autor se transfieren al jefe del autor. En muchos los lugares, no necesita hacer nada para obtener los derechos de autor. Tan pronto como realiza un trabajo creativo, usted (o su jefe) tiene instantáneamente los derechos de autor sobre él.
fr: Habituellement, l'auteur est le titulaire du droit d'auteur, mais le droit d'auteur est souvent transféré à l'employeur de l'auteur. Dans la plupart des endroits, vous n'avez rien à faire pour obtenir des droits d'auteur. Dès que vous réalisez une œuvre créative, vous (ou votre employeur) obtenez instantanément des droits d'auteur sur celle-ci.
uk: Зазвичай автор є власником авторських прав, але часто авторське право передається роботодавцю автора. У більшості місць для отримання авторських прав не потрібно нічого робити. Щойно ви щось створюєте, ви (або ваш роботодавець) миттєво отримуєте авторські права на свій доробок.

source: Creative Commons provides a better and lengthier answer in their [Frequently Asked Questions](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
es: Creative Commons proporciona una respuesta mejor y más extensa en sus [Preguntas frecuentes](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
fr: Creative Commons fournit une réponse meilleure et plus longue dans leurs [Foire Aux Questions](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).
uk: Creative Commons надає кращу та довшу відповідь у своїх [Частих запитаннях](https://creativecommons.org/faq/#what-is-copyright-and-why-does-it-matter).

source: What is a license? {#what-is-license}
es: ¿Qué es una licencia? {#what-is-license}
fr: Qu'est-ce qu'une licence ? {#what-is-license}
uk: Що таке ліцензія? {#what-is-license}

source: One problem with copyright as it pertains to software is that it makes software unshareable by default. A license changes that. A license defines the terms under which the copyright holder allows the recipient of the license to use the software.
es: Un problema con los derechos de autor en lo que respecta al software es que hace que el software no se pueda compartir de forma predeterminada. Una licencia cambia eso. Una licencia define los términos bajo los cuales el titular de los derechos de autor permite que el destinatario de la licencia use el software.
fr: Un problème avec le droit d'auteur en ce qui concerne les logiciels est qu'il rend les logiciels non partageables par défaut. Une licence change cela. Une licence définit les conditions dans lesquelles le titulaire du droit d'auteur autorise le destinataire de la licence à utiliser le logiciel.
uk: Однією з проблем авторського права, що стосується програмного забезпечення, є те, що воно робить програмне забезпечення недоступним для спільного користування одразу після створення. Ліцензія змінює це. Ліцензія визначає умови, на яких власник авторських прав дозволяє одержувачу ліцензії користуватися програмним забезпеченням.

source: If the license allows the recipient to [use, study, share and improve](https://fsfe.org/freesoftware/basics/4freedoms.html) the software, then that software is [Free Software](https://fsfe.org/about/basics/freesoftware).
es: Si la licencia permite al receptor [utilizar, estudiar, compartir y mejorar](https://fsfe.org/freesoftware/basics/4freedoms.html) el software, entonces ese software es [Software Libre](https://fsfe.org/about/basics/freesoftware).
fr: Si la licence permet au destinataire [d'utiliser, d'étudier, de partager et d'améliorer](https://fsfe.org/freesoftware/basics/4freedoms.html) le logiciel, alors ce logiciel est un [Logiciel libre](https://fsfe.org/about/basics/freesoftware).
uk: Якщо ліцензія дозволяє одержувачу [користуватися, вивчати, ділитися та вдосконалювати](https://fsfe.org/freesoftware/basics/4freedoms.html) програмне забезпечення, то воно є [Вільним програмним забезпеченням](https://fsfe.org/about/basics/freesoftware).

source: Which license should I choose? {#which-license}
es: ¿Qué licencia debo elegir? {#which-license}
fr: Quelle licence dois-je choisir ? {#which-license}
uk: Яку ліцензію слід обрати? {#which-license}

source: Always choose a Free Software license, i.e., a license that gives the recipient the freedom to use, study, share, and improve the software. Aside from that, the license you choose is up to you. If you are contributing to an existing project, you should release your changes under the same license as the project. Otherwise, the [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/), and [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) have some good recommendations. Note that these resources each emphasise a different value, and come with their own biases.
es: Elija siempre una licencia de Software Libre, esto es, una licencia que de al destinatario la libertad de utilizar, estudiar, compartir y mejorar el software. Aparte de eso, la licencia que elijas depende de ti. Si estás contribuyendo a un proyecto existente, deberías publicar tus cambios bajo la misma licencia que el proyecto. De lo contrario, la [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/), y [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) tienen algunas buenas recomendaciones. Hay que tener en cuenta que cada uno de estos recursos hace hincapié en un valor diferente, y vienen con sus propias preferencias.
fr: Choisissez toujours une licence de logiciel libre, c'est-à-dire une licence qui donne au destinataire la liberté d'utiliser, d'étudier, de partager et d'améliorer le logiciel. En dehors de cela, la licence que vous choisissez dépend de vous. Si vous contribuez à un projet existant, vous devez publier vos modifications sous la même licence que le projet. Sinon, la [Free Software Foundation](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/) et [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) ont quelques bonnes recommandations. Notez que ces ressources mettent chacune l'accent sur une valeur différente et ont leurs propres préjugés.
uk: Завжди обирайте вільну ліцензію, тобто ліцензію, яка дає одержувачу свободу користуватися, вивчати, ділитися та вдосконалювати програмним забезпеченням. Крім того, ліцензія, яку ви обираєте, стосується і вас. Якщо ви робите внесок до наявного проєкту, слід випустити зміни під тією ж ліцензією, що й проєкт. В іншому випадку [Фонд вільного програмного забезпечення](https://www.gnu.org/licenses/license-recommendations.html), [choosealicense.com](https://choosealicense.com/), та [joinup.eu](https://joinup.ec.europa.eu/collection/eupl/joinup-licensing-assistant-jla) мають кілька хороших порад. Зауважте, що ці ресурси наголошують на різних цінностях і мають свої власні упередження.

source: Above all, if you value freedom, you should choose a license that makes your software [Free Software](https://fsfe.org/about/basics/freesoftware.en.html).
es: Sobre todo, si valoras la libertad, debes elegir una licencia que haga tu software [Software Libre](https://fsfe.org/about/basics/freesoftware.en.html).
fr: Surtout, si vous appréciez la liberté, vous devez choisir une licence qui fait de votre logiciel un [Logiciel Libre](https://fsfe.org/about/basics/freesoftware.en.html).
uk: Якщо ви цінуєте свободу, перш за все ви повинні вибрати ліцензію, яка робить ваше програмне забезпечення [Вільним програмним забезпеченням](https://fsfe.org/about/basics/freesoftware.en.html).

source: <!-- ## Do I really need to include the license and copyright headers in all files? Why should I care? {#why-care}
es: <!-- ## ¿Realmente necesito incluir las cabeceras de licencia y copyright en todos los archivos? ¿Por qué debería preocuparme? {#why-care}
fr: <!-- ## Dois-je vraiment inclure les en-têtes de licence et de droits d'auteur dans tous les fichiers ? Pourquoi devrais-je m'en soucier ? {#why-care}
uk: <!-- ## Чи дійсно мені потрібно долучити ліцензію та заголовки авторських прав у всі файли? Чому я повинен піклуватися про це? {#why-care}

source: What is SPDX? {#what-is-spdx}
es: ¿Qué es SPDX? {#what-is-spdx}
fr: Qu'est-ce que SPDX ? {#what-is-spdx}
uk: Що таке SPDX? {#what-is-spdx}

source: SPDX stands for [Software Package Data Exchange](https://spdx.org/). It is a project by the [Linux Foundation](https://www.linuxfoundation.org/) and the rock upon which REUSE is built. SPDX defines a standardized way to share copyright and licensing information between projects and people. Most importantly for REUSE, SPDX maintains the [SPDX License List](https://spdx.org/licenses/), which defines standardized identifiers for a lot of licenses.
es: SPDX siglas de [Software Package Data Exchange](https://spdx.org/). Es un proyecto de la [Linux Foundation](https://www.linuxfoundation.org/) y el pilar sobre el que se construye REUSE. SPDX define una forma normalizada de compartir información sobre derechos de autor y licencias entre proyectos y personas. Lo más importante para REUSE, SPDX mantiene la [SPDX License List](https://spdx.org/licenses/), que define identificadores estandarizados para un montón de licencias.
fr: SPDX signifie [Software Package Data Exchange](https://spdx.org/). C'est un projet de la [Linux Foundation](https://www.linuxfoundation.org/) et du rocher sur lequel REUSE est construit. SPDX définit une manière standardisée de partager les informations de droit d'auteur et de licence entre les projets et les personnes. Plus important encore pour REUSE, SPDX gère la [Liste des licences SPDX](https://spdx.org/licenses/), qui définit des identifiants standardisés pour un grand nombre de licences.
uk: SPDX розшифровується як [Обмін даними пакунків програмного забезпечення](https://spdx.org/). Це проєкт [Linux Foundation](https://www.linuxfoundation.org/) і є основою побудови REUSE. SPDX визначає стандартизований спосіб обміну інформацією про авторські права та ліцензування між проєктами та людьми. Найголовніше для REUSE, це те, що SPDX підтримує [Список ліцензій SPDX](https://spdx.org/licenses/), який визначає стандартизовані ідентифікатори для багатьох ліцензій.

source: The tool {#tool}
es: La herramienta {#tool}
fr: L'outil {#tool}
uk: Засіб {#tool}

source: How do I install and use the REUSE tool? {#install-tool}
es: ¿Cómo instalo y utilizo la herramienta REUSE? {#install-tool}
fr: Comment installer et utiliser l'outil REUSE ? {#install-tool}
uk: Як встановити та користуватися засобом REUSE? {#install-tool}

source: The REUSE tool is a handy companion that can verify your compliance with REUSE and automate a lot of adjacent tasks. You can find the full documentation for the tool at <https://reuse.readthedocs.io/>. But the short of it is:
es: La herramienta REUSE es un práctico aliado que puede verificar el cumplimiento de REUSE y automatizar muchas tareas contiguas. Puedes encontrar la documentación completa de la herramienta en <https://reuse.readthedocs.io/>. Pero en resumen:
fr: L'outil REUSE est un compagnon pratique qui peut vérifier votre conformité avec REUSE et automatiser de nombreuses tâches adjacentes. Vous pouvez trouver la documentation complète de l'outil sur <https://reuse.readthedocs.io/>. Mais en bref, c'est :
uk: Засіб REUSE — це зручний компаньйон, який може перевірити відповідність до REUSE та автоматизувати багато суміжних завдань. Повну документацію до засобу можна знайти за адресою <https://reuse.readthedocs.io/>. Але якщо коротко:

source: How do I exclude a file from REUSE compliance testing? {#exclude-file}
es: ¿Cómo puedo excluir un archivo de las pruebas de conformidad de REUSE? {#exclude-file}
fr: Comment exclure un fichier des tests de conformité REUSE ? {#exclude-file}
uk: Як виключити файл із перевірки на відповідність REUSE? {#exclude-file}

source: If the file is a build artifact and you use Git, simply make sure that the file is covered by your `.gitignore` file.
es: Si el archivo es un artefacto hecho y usas Git, simplemente asegúrate de que el archivo está cubierto por tu archivo `.gitignore`.
fr: Si le fichier est un artefact de construction et que vous utilisez Git, assurez-vous simplement que le fichier est couvert par votre fichier `.gitignore`.
uk: Якщо файл є артефактом збирання, і ви застосовуєте Git, просто переконайтеся, що файл покривається вашим файлом `.gitignore`.

source: Otherwise, you cannot exclude files from REUSE compliance testing. It would go entirely against the purpose of REUSE: making sure that every file has a copyright and license tag.
es: De lo contrario, no se pueden excluir los archivos de las pruebas de conformidad de REUSE. Iría totalmente en contra del objetivo de REUSE: asegurarse de que todos los archivos tienen una etiqueta de copyright y licencia.
fr: Sinon, vous ne pouvez pas exclure des fichiers des tests de conformité REUSE. Cela irait totalement à l'encontre du but de REUSE : s'assurer que chaque fichier a une balise de copyright et de licence.
uk: В іншому випадку не можна виключити файли з перевірки відповідності REUSE. Це суперечитиме меті REUSE: переконайтеся, що кожен файл має авторське право та тег ліцензії.

source: If you really want to exclude a file, consider using the [CC0](https://creativecommons.org/publicdomain/zero/1.0/) license for this file. By doing this, you put the file in the public domain, or your country's equivalent.
es: Si realmente quiere excluir un archivo, mire la posibilidad de utilizar la licencia [CC0](https://creativecommons.org/publicdomain/zero/1.0/) para este archivo. Así, el archivo pasa a ser de dominio público, o el equivalente de su país.
fr: Si vous voulez vraiment exclure un fichier, envisagez d'utiliser la licence [CC0](https://creativecommons.org/publicdomain/zero/1.0/) pour ce fichier. En faisant cela, vous placez le fichier dans le domaine public, ou l'équivalent de votre pays.
uk: Якщо ви дійсно хочете виключити файл, спробуйте скористатися ліцензію [CC0](https://creativecommons.org/publicdomain/zero/1.0/) для цього файлу. Таким чином, ви робите файл суспільним надбанням або його еквівалентом у вашій країні.

source: There is one exception: License files are automatically excluded from compliance testing.
es: Hay una excepción: Los archivos de licencia se excluyen automáticamente de las pruebas de conformidad.
fr: Il existe une exception : les fichiers de licence sont automatiquement exclus des tests de conformité.
uk: Є один виняток: ліцензійні файли автоматично виключаються з перевірки на відповідність.

source: If you have an entire directory that you want to "exclude" from REUSE compliance testing, you can [use a DEP5 file](#bulk-license).
es: Si tienes un directorio completo que deseas "excluir" de las pruebas de conformidad de REUSE, puedes [usar un archivo DEP5] (#bulk-license).
fr: Si vous avez un répertoire entier que vous souhaitez «exclure» des tests de conformité REUSE, vous pouvez [utiliser un fichier DEP5](#bulk-license).
uk: Якщо у вас є цілий каталог, який потрібно «виключити» з перевірки на відповідність REUSE, ви можете [застосовувати файл DEP5](#bulk-license).

source: Do you support a version control system other than Git? {#no-git}
es: ¿Admite un sistema de control de versiones distinto de Git? {#no-git}
fr: Prenez-vous en charge un système de contrôle de version autre que Git ? {#no-git}
uk: Чи підтримуєте ви інші системи контролю версій, крім Git? {#no-git}

source: Currently we do not, but please [get in touch](https://github.com/fsfe/reuse-tool/issues).
es: Actualmente no lo hacemos, pero por favor [contacte con] (https://github.com/fsfe/reuse-tool/issues).
fr: Actuellement, nous ne le faisons pas, mais s'il vous plaît [contactez-nous](https://github.com/fsfe/reuse-tool/issues).
uk: На разі — ні, але [стежте за оновленнями](https://github.com/fsfe/reuse-tool/issues).

source: Licensing and compliance {#licensing}
es: Licencias y cumplimiento {#licensing}
fr: Licences et conformité {#licensing}
uk: Ліцензування та відповідність {#licensing}

source: <!-- ## Which licenses are compatible? {#compatible-licenses} -->
es: <!-- ## ¿Qué licencias son compatibles? {#compatible-licenses} -->
fr: <!-- ## Quelles licences sont compatibles ? {#compatible-licenses} -->
uk: <!-- ## Які ліцензії сумісні? {#compatible-licenses} -->

source: Is there a standard format for declaring copyright? {#standard-copyright}
es: ¿Existe un formato estándar para declarar los derechos de autor? {#standard-copyright}
fr: Existe-t-il un format standard pour déclarer les droits d'auteur ? {#standard-copyright}
uk: Чи існує стандартний формат декларування авторських прав? {#standard-copyright}
