Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: Everything that applies to licenses in this section also applies to license exceptions, with the exception that it is NOT possible to have a license exception that does not exist in the SPDX License List.
es: Todo lo que se aplica a las licencias en esta sección también se aplica a las excepciones de licencia, con la excepción de que NO es posible tener una excepción de licencia que no exista en la Lista de licencias SPDX.
fr: Tout ce qui s'applique aux licences dans cette section s'applique également aux exceptions de licence, à l'exception qu'il n'est PAS possible d'avoir une exception de licence qui n'existe pas dans la liste de licences SPDX.
uk: Усе, що стосується ліцензій у цьому розділі, також стосується ліцензійних винятків, за винятком тих, що НЕ можуть мати ліцензійного винятку, якого немає у списку ліцензій SPDX.

source: Copyright and Licensing Information
es: Información sobre Derechos de Autor y Licencias
fr: Informations sur les droits d'auteur et les licences
uk: Відомості про авторські права та ліцензування

source: Each file in the Project MUST have Copyright and Licensing Information associated with it, except the following files:
es: Cada archivo del proyecto DEBE tener asociado Información de Licencia y Derechos de autor, excepto los siguientes archivos:
fr: Chaque fichier du projet DOIT être associé à des informations de droit d'auteur et de licence, à l'exception des fichiers suivants :
uk: Кожен файл у проєкті ПОВИНЕН містити відомості про авторські права та ліцензування, пов’язану з ним, за винятком таких файлів:

source: - The License Files.
es: - Los Archivos de Licencia.
fr: - Les fichiers de licence.
uk: - Файли ліцензій.

source: The files belonging to the Project's version control system (example: `.git/`).
es: Los archivos pertenecientes al sistema de control de versiones del Proyecto (ejemplo: `.git/`).
fr: Les fichiers appartenant au système de contrôle de version du projet (exemple : `.git/`).
uk: Файли, що належать до системи контролю версій Проєкту (наприклад: `.git/`).

source: The files ignored by the version control system (example: Files listed in `.gitignore`).
es: Los archivos ignorados por el sistema de control de versiones (ejemplo: Archivos enumerados en `.gitignore`).
fr: Les fichiers ignorés par le système de contrôle de version (exemple : Fichiers répertoriés dans `.gitignore`).
uk: Файли, проігноровані системою контролю версій (наприклад: Файли, перелічені в `.gitignore`).

source: The files in the `.reuse/` directory in the root of the Project. This directory MUST contain only files relevant for the operation of the REUSE Tool.
es: Los archivos en el directorio `.reuse/` en la raíz del Proyecto. Este directorio DEBE contener solo archivos relevantes para el funcionamiento de la herramienta REUSE.
fr: Les fichiers du répertoire `.reuse/` à la racine du projet. Ce répertoire DOIT contenir uniquement les fichiers pertinents pour le fonctionnement de l'outil REUSE.
uk: Файли в каталозі `.reuse/` в корені проєкту. Цей каталог повинен містити лише файли, що стосуються роботи засобу REUSE.

source: There are two ways to associate Copyright and Licensing Information with a file.
es: Hay dos formas de asociar la información de Derechos de Autor y Licencias con un archivo.
fr: Il existe deux façons d'associer des informations de droit d'auteur et de licence à un fichier.
uk: Існує два способи пов'язування відомостей про авторські права та ліцензування з файлом.

source: Comment headers
es: Encabezado de los comentarios
fr: En-têtes de commentaire
uk: Коментарі в заголовку

source: To implement this method, each plain text file that can contain comments MUST contain comments at the top of the file (comment header) that declare that file's Copyright and Licensing Information.
es: Para aplicar este método, cada archivo de texto plano que pueda contener comentarios DEBE contener comentarios en la parte superior del archivo (comment header) que declaren la información de copyright y licencia de ese archivo.
fr: Pour implémenter cette méthode, chaque fichier de texte brut qui peut contenir des commentaires DOIT contenir des commentaires en haut du fichier (en-tête de commentaire) qui déclarent les informations de droit d'auteur et de licence de ce fichier.
uk: Щоб впровадити цей метод, кожен звичайний текстовий файл, який може містити коментарі, ПОВИНЕН містити коментарі у верхній частині файлу (заголовок коментаря), які оголошують відомості про авторські права та ліцензування цього файлу.

source: If a file is not a plain text file or does not permit the inclusion of comments, the comment header that declares the file's Copyright and Licensing Information SHOULD be in an adjacent file of the same name with the additional extension `.license` (example: `cat.jpg.license` if the original file is `cat.jpg`).
es: Si un archivo no es un archivo de texto plano o no permite la inclusión de comentarios, la cabecera del comentario que declara la información sobre Derechos de Autor y Licencias del archivo DEBERÍA estar en un archivo adjunto con el mismo nombre y la extensión adicional `.license` (ejemplo: `cat.jpg.license` si el archivo original es `cat.jpg`).
fr: Si un fichier n'est pas un fichier texte brut ou ne permet pas l'inclusion de commentaires, l'en-tête de commentaire qui déclare les informations de droit d'auteur et de licence du fichier DEVRAIT être dans un fichier adjacent du même nom avec l'extension supplémentaire `.license` (exemple : `cat.jpg.license` si le fichier original est `cat.jpg`).
uk: Якщо файл не є звичайним текстовим файлом або не дозволяє включати коментарі, заголовок коментаря, який оголошує відомості про авторські права та ліцензування файлу, ПОВИНЕН бути в суміжному файлі з тією самою назвою з додатковим розширенням `.license`. (приклад: `cat.jpg.license`, якщо джерельний файл — `cat.jpg`).

source: The comment header MUST contain one or more `SPDX-FileCopyrightText` tags, and one or more `SPDX-License-Identifier` tags. A tag is followed by a colon, followed by a text value, and terminated by a newline.
es: La cabecera del comentario DEBE contener una o más etiquetas `SPDX-FileCopyrightText`, y una o más etiquetas `SPDX-License-Identifier`. Una etiqueta va seguida de dos puntos, seguida de un valor de texto y terminada por una nueva línea.
fr: L'en-tête de commentaire DOIT contenir une ou plusieurs balises `SPDX-FileCopyrightText` et une ou plusieurs balises `SPDX-License-Identifier`. Une balise est suivie de deux points, suivie d'une valeur de texte et terminée par une nouvelle ligne.
uk: Заголовок коментаря ПОВИНЕН містити один або кілька тегів `SPDX-FileCopyrightText`` і один або кілька тегів `SPDX-License-Identifier`. Після тегу слід додати двокрапку, далі текстове значення і завершити переходом на новий рядок.

source: The `SPDX-FileCopyrightText` tag MUST be followed by a copyright notice.
es: La etiqueta `SPDX-FileCopyrightText` DEBE ir seguida de un aviso de copyright.
fr: La balise `SPDX-FileCopyrightText` DOIT être suivie d'une notice de droit d'auteur.
uk: Тег `SPDX-FileCopyrightText` ПОВИНЕН стояти перед повідомленням про авторські права.

source: Instead of the `SPDX-FileCopyrightText` tag, the symbol `©`, or the word `Copyright` MAY be used, in which case a colon is not needed.
es: En lugar de la etiqueta `SPDX-FileCopyrightText`, PUEDE utilizarse el símbolo `©`, o la palabra `Copyright`, en cuyo caso no se necesitan dos puntos.
fr: Au lieu de la balise `SPDX-FileCopyrightText`, le symbole`©`, ou le mot `Copyright` PEUT être utilisé, auquel cas un deux-points n'est pas nécessaire.
uk: Замість тегу `SPDX-FileCopyrightText` МОЖЕ застосовуватися символ `©` або слово `Copyright`, і в цьому випадку двокрапка не потрібна.

source: The `SPDX-License-Identifier` tag MUST be followed by a valid SPDX License Expression describing the licensing of the file (example: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`). If separate sections of the file are licensed differently, a different `SPDX-License-Identifier` tag MUST be included for each section.
es: La etiqueta `SPDX-License-Identifier` DEBE ir seguida de una Expresión de Licencia SPDX válida que describa la licencia del archivo (ejemplo: `SPDX-License-Identifier: GPL-3.0-o-later OR Apache-2.0`). Si hay secciones separadas del archivo que tienen una licencia diferente, debe incluirse una etiqueta `SPDX-License-Identifier` diferente para cada sección.
fr: La balise `SPDX-License-Identifier` DOIT être suivie d'une expression de licence SPDX valide décrivant la licence du fichier (exemple :` SPDX-License-Identifier: GPL-3.0-or-later OU Apache-2.0`). Si des sections distinctes du fichier ont une licence différente, une étiquette `SPDX-License-Identifier` différente DOIT être incluse pour chaque section.
uk: Тег `SPDX-License-Identifier` ПОВИНЕН супроводжуватися дійсним виразом ліцензії SPDX, що описує ліцензування файлу (наприклад: `SPDX-License-Identifier: GPL-3.0-or-later OR Apache-2.0`). Якщо окремі розділи файлу ліцензуються по-різному, для кожного розділу ПОВИНЕН бути включено свій тег `SPDX-License-Identifier`.

source: An example of a comment header:
es: Un ejemplo de una comment header:
fr: Un exemple d'en-tête de commentaire :
uk: Приклад заголовка коментаря:

source: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Example Company # # SPDX-License-Identifier: GPL-3.0-or-later
es: # SPDX-FileCopyrightText: 2016, 2018-2019 Jane Doe <jane@example.com> # SPDX-FileCopyrightText: 2019 Example Company # # SPDX-License-Identifier: GPL-3.0-o-posterior

source: Alternatively, Copyright and Licensing Information MAY be associated with a file through a DEP5 file. The intended use case of this method is large directories where including a comment header in each file (or in `.license` companion files) is impossible or undesirable.
es: Alternativamente, la información sobre Derechos de Autor y Licencias PUEDE estar asociada a un archivo a través de un archivo DEP5. El caso de uso previsto de este método son los directorios grandes en los que la inclusión de un comment header en cada archivo (o en los archivos complementarios `.license`) es imposible o no deseable.
fr: Alternativement, les informations de droit d'auteur et de licence PEUVENT être associées à un fichier via un fichier DEP5. Le cas d'utilisation prévu de cette méthode est de grands répertoires où l'inclusion d'un en-tête de commentaire dans chaque fichier (ou dans les fichiers compagnons `.license`) est impossible ou indésirable.
uk: Крім того, відомості про авторські права та ліцензування МОЖУТЬ бути пов'язані з файлом через файл DEP5. Передбачуваний випадок використання цього методу — великі каталоги, до яких включення заголовка коментаря в кожен файл (або в супутні файли `.license`) неможливе або небажане.

source: The DEP5 file MUST be named `dep5` and stored in the `.reuse/` directory in the root of the Project (i.e. `.reuse/dep5`).
es: El archivo DEP5 DEBE llamarse `dep5` y se almacena en el directorio `.reuse/` en la raíz del Proyecto (i.e. `.reuse/dep5`).
fr: Le fichier DEP5 DOIT être nommé `dep5` et stocké dans le répertoire `.reuse/` à la racine du projet (c'est-à-dire `.reuse/dep5`).
uk: Файл DEP5 ПОВИНЕН мати назву `dep5` і зберігатися в каталозі `.reuse/` у корені проєкту (тобто `.reuse/dep5`).

source: The `License` tag MUST be followed by a valid SPDX License Expression describing the licensing of the associated files.
es: La etiqueta `License` DEBE ir seguida de una Expresión de Licencia SPDX válida que describa la licencia de los archivos asociados.
fr: L'étiquette `License` DOIT être suivie d'une expression de licence SPDX valide décrivant la licence des fichiers associés.
uk: За тегом `License` ПОВИНЕН слідувати дійсний вираз ліцензії SPDX, що описує ліцензування пов’язаних файлів.

source: The `Copyright` tag MUST be followed by a copyright notice.
es: La etiqueta `Copyright` DEBE ir seguida de un aviso de copyright.
fr: La balise `Copyright` DOIT être suivie d'un avis de droit d'auteur.
uk: За тегом `Copyright` ПОВИННЕ слідувати повідомлення про авторські права.

source: An example of a DEP5 file:
es: Un ejemplo de archivo DEP5:
fr: Un exemple de fichier DEP5 :
uk: Приклад файлу DEP5:

source: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: Project Upstream-Contact: Jane Doe <jane@example.com> Source: https://example.com/jane/project Files: po/* Copyright: 2019 Translation Company License: GPL-3.0-or-later
es: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: Proyecto Upstream-Contact: Jane Doe <jane@example.com> Source: https://example.com/jane/proyecto Files: po/* Copyright: 2019 Translation Company Licencia: GPL-3.0-o-posterior

source: Format of copyright notices
es: Formato de las notas de derechos de autor
fr: Format des avis de droits d'auteur
uk: Формат повідомлень про авторські права

source: A copyright notice MUST be prefixed by a tag, symbol or word denoting a copyright notice as described in this specification.
es: Una nota de copyright DEBE ir precedida de una etiqueta, símbolo o palabra que señale una nota de copyright tal y como se describe en esta especificación.
fr: Un avis de droit d'auteur DOIT être précédé d'une balise, d'un symbole ou d'un mot indiquant un avis de droit d'auteur tel que décrit dans cette spécification.
uk: Повідомлення про авторські права МАЄ передбачати тег, символ або слово, що позначає повідомлення про авторські права, як описано у цій специфікації.

source: The copyright notice MUST contain the name of the copyright holder. The copyright notice SHOULD contain the year of publication and the contact address of the copyright holder. The order of these items SHOULD be: year, name, contact address.
es: El aviso de copyright DEBE contener el nombre del titular del copyright. La nota de copyright DEBERÍA contener el año de publicación y la dirección de contacto del titular del copyright. El orden de estos elementos DEBERÍA ser: año, nombre, dirección de contacto.
fr: L'avis de droit d'auteur DOIT contenir le nom du détenteur du droit d'auteur. L'avis de droit d'auteur DEVRAIT contenir l'année de publication et l'adresse de contact du détenteur du droit d'auteur. L'ordre de ces articles DEVRAIT être : année, nom, adresse de contact.
uk: Повідомлення про авторські права ПОВИННО містити ім'я власника авторських прав. Повідомлення про авторські права ПОВИННО містити рік публікації та контактну адресу власника авторських прав. Порядок цих повинен бути таким: рік, ім'я, контактна адреса.

source: The year of publication MAY be a single year, multiple years, or a span of years.
es: El año de publicación PUEDE ser un solo año, varios años o un intervalo de años.
fr: L'année de publication PEUT être une seule année, plusieurs années ou un intervalle d'années.
uk: Рік публікації МОЖЕ бути один рік, кілька років, або проміжок років.

source: The copyright holder MAY be an individual, list of individuals, group, legal entity, or any other descriptor by which one can easily identify the copyright holder(s).
es: El titular de los derechos de autor PUEDE ser una persona, una lista de personas, un grupo, una entidad legal o cualquier otro descriptor por el que se pueda identificar fácilmente al titular o titulares de los derechos de autor.
fr: Le détenteur du droit d'auteur PEUT être un individu, une liste d'individus, un groupe, une personne morale ou tout autre descripteur permettant d'identifier facilement le(s) détenteur(s) du droit d'auteur.
uk: Власником авторських прав МОЖЕ бути фізична особа, список осіб, група, юридична особа або будь-який інший дескриптор, за яким можна легко ідентифікувати власника(ів) авторських прав.

source: Any contact address SHOULD be in between angle brackets.
es: Cualquier dirección de contacto DEBE ir entre corchetes.
fr: Toute adresse de contact DEVRAIT être entre crochets angulaires.
uk: Будь-яка контактна адреса ПОВИННА розміщуватися між кутовими дужками.

source: Examples of valid copyright notices:
es: Ejemplos de anuncios válidos de copyright:
fr: Exemples d'avis de droits d'auteur valides :
uk: Приклади правильних повідомлень про авторські права:

source: Tutorial: How to become REUSE-compliant
es: Tutorial: Cómo llegar a ser REUSE compatible
fr: Tutoriel : Comment devenir conforme à REUSE
uk: Підручник: Як стати сумісним з REUSE

source: This tutorial explains the basic methods of how to make a software project REUSE-compliant. By the end of this document, all your files will clearly have their copyright and licensing marked, and you will be able to verify this using the REUSE helper tool.
es: Este tutorial explica los métodos básicos de cómo hacer un proyecto de software REUSE compatible. Al terminar este documento, todos sus archivos tendrán claramente marcados sus derechos de autor y licencias, y podrá verificarlo utilizando la herramienta de ayuda REUSE.
fr: Ce tutoriel explique les méthodes de base permettant de rendre un projet logiciel conforme à REUSE. À la fin de ce document, tous vos fichiers auront clairement leurs droits d'auteur et licences marqués, et vous pourrez le vérifier à l'aide de l'outil d'assistance REUSE.
uk: У цьому посібнику пояснюються основні методи, як зробити програмний проєкт сумісним із REUSE. Вивчивши цей документ ви знатимете як чітко вказати авторські права і ліцензією своїх файлів, і ви зможете перевірити правильність за допомогою допоміжного засобу REUSE.

source: Making your project REUSE-compliant can be done in three simple steps:
es: Para hacer su proyecto REUSE compatible basta con tres sencillos pasos:
fr: Rendre votre projet conforme à REUSE peut se faire en trois étapes simples :
uk: Зробити ваш проєкт сумісним із REUSE можна виконавши три прості кроки:

source: Choose and provide licenses
es: Elija y proporcione licencias
fr: Choisir et fournir des licences
uk: Виберіть і вкажіть ліцензії

source: Add copyright and license information to each file
es: Añada información de copyright y licencia a cada archivo
fr: Ajouter les informations de droit d'auteur et de licence pour chaque fichier
uk: Додайте інформацію про авторські права та ліцензію до кожного файлу

source: Confirm REUSE compliance
es: Confirme el cumplimiento de REUSE
fr: Confirmer la conformité REUSE
uk: Підтвердьте відповідність REUSE

source: For the purpose of this tutorial, we will assume that the directory of your project looks like this:
es: Para el propósito de este tutorial, asumiremos que el directorio de su proyecto se ve así:
fr: Pour les besoins de ce tutoriel, nous supposerons que le répertoire de votre projet ressemble à ceci :
uk: Для цього навчання ми припустимо, що каталог вашого проєкту має такий вигляд:

source: project/ ├── img/ │ ├── cat.jpg │ └── dog.jpg ├── src/ │ └── main.c ├── .gitignore ├── Makefile └── README.md
es: proyecto/ ├── img/ │ ├── gato.jpg │ └── perro.jpg ├── origen/ │ └── principal.c ├── .gitignore ├── Makefile └── LÉAME.md

source: If you would like to reproduce the steps in this tutorial on your own computer, you can clone the [example repository](https://github.com/fsfe/reuse-example). The branch `noncompliant` matches the structure above, while the `master` branch is the successful result of this repository.
es: Si quieres reproducir los pasos de este tutorial en tu propio ordenador, puedes clonar el [repositorio de ejemplo](https://github.com/fsfe/reuse-example). La rama `noncompliant` coincide con la estructura anterior, mientras que la rama `master` es el resultado bueno de este repositorio.
fr: Si vous souhaitez reproduire les étapes de ce tutoriel sur votre propre ordinateur, vous pouvez cloner le [répertoire d'exemple](https://github.com/fsfe/reuse-example). La branche `noncompliant` correspond à la structure ci-dessus, tandis que la branche `master` est le résultat réussi de ce répertoire.
uk: Якщо ви хочете відтворити кроки цього посібника на своєму комп’ютері, ви можете клонувати [репозиторій прикладів](https://github.com/fsfe/reuse-example). Гілка `noncompliant` відповідає структурі вище, а гілка `master` — успішний результат цього репозиторію.

source: For each of these steps, you will first learn how to achieve them manually. However, the [REUSE helper tool](https://github.com/fsfe/reuse-tool) supports you with most tasks, and the necessary commands will be listed as well in the collapsible boxes. We recommend to first understand the basic principle before just executing the tool's commands.
es: Para cada uno de estos pasos, primero aprenderá cómo lograrlos manualmente. Sin embargo, la [herramienta de ayuda REUSE] (https://github.com/fsfe/reuse-tool) lo ayuda con la mayoría de las tareas, y los comandos necesarios también se enumerarán en los menúes desplegables. Recomendamos comprender primero el principio básico antes de ejecutar los comandos de la herramienta.
fr: Pour chacune de ces étapes, vous apprendrez d'abord à les réaliser manuellement. Cependant, l'[outil d'aide REUSE](https://github.com/fsfe/reuse-tool) vous assiste dans la plupart des tâches, et les commandes nécessaires seront également répertoriées dans les cases réductibles. Nous vous recommandons de comprendre d'abord le principe de base avant d'exécuter simplement les commandes de l'outil.
uk: Для кожного з цих кроків ви спочатку дізнаєтеся, як виконати їх вручну. Однак [допоміжний засіб REUSE](https://github.com/fsfe/reuse-tool) підтримує більшість завдань, а необхідні команди також будуть перераховані в розділах, що згортаються. Ми рекомендуємо спочатку зрозуміти основний принцип, перш ніж просто виконувати команди інструмента.

source: The first thing you need to do is to [choose a license]({{< relref "faq.md#which-license" >}}). For this tutorial, we assume that you chose the GNU General Public License (GPL) v3.0 or any later version. More than simply choosing a license, you need to put the license in your project directory.
es: Lo primero que debe hacer es [elegir una licencia]({{< relref "faq.md#which-license" >}}). Para este tutorial, asumimos que eligió la GNU Licencia Pública General (GPL) v3.0 o cualquier versión posterior. Más que solo elegir una licencia, debe colocar la licencia en el directorio de su proyecto.
fr: La première chose à faire est de [choisir une licence]({{< relref "faq.md#which-license" >}}). Pour ce tutoriel, nous supposons que vous avez choisi la GNU Licence publique générale (GPL) v3.0 ou toute version ultérieure. Plus que simplement en choisissant une licence, vous devez mettre la licence dans le répertoire de votre projet.
uk: Перше, що вам потрібно зробити, це [обрати ліцензію]({{< relref "faq.md#which-license" >}}). У цьому посібнику ми припускаємо, що ви вибрали Загальну публічну ліцензію GNU (GPL) v3.0 або новішу версію. Обравши ліцензію, вам потрібно розмістити ліцензію в каталозі вашого проєкту.
