Repository: fsfe/reuse-docs
Catalog: po/reuse-docs.*.po
Languages: es, fr, uk

source: Additionally, many package hosting sites expect that you declare the licensing information of your package. For instance, the [setup.py file of the REUSE tool](https://github.com/fsfe/reuse-tool/blob/master/setup.py) declares all the licenses that it uses in the format expected by the Python packaging infrastructure.
es: Además, muchos sitios de alojamiento de paquetes esperan que declares la información de la licencia de tu paquete. Por ejemplo, el [archivo setup.py de la herramienta REUSE](https://github.com/fsfe/reuse-tool/blob/master/setup.py) declara todas las licencias que utiliza en el formato esperado para la infraestructura de empaquetado de Python.
fr: De plus, de nombreux sites d'hébergement de packages s'attendent à ce que vous déclariez les informations de licence de votre package. Par exemple, le [fichier setup.py de l'outil REUSE](https://github.com/fsfe/reuse-tool/blob/master/setup.py) déclare toutes les licences qu'il utilise au format attendu par le Infrastructure d'empaquetage Python.
uk: Крім того, багато сайтів, які розміщують пакунки, очікують, що ви оголошуєте ліцензійну інформацію вашого пакунка. Наприклад, [файл setup.py засобу REUSE](https://github.com/fsfe/reuse-tool/blob/master/setup.py) оголошує всі ліцензії, якими він користується у форматі, очікуваному інфраструктурою пакування Python.

source: What is a copyright holder, and what is an author? {#copyright-holder-author}
es: ¿Qué es un titular de derechos de autor y qué es un autor? {#copyright-holder-author}
fr: Qu'est-ce qu'un détenteur de droits d'auteur et qu'est-ce qu'un auteur ? {#copyright-holder-author}
uk: Хто такий власник авторських прав і хто такий автор? {#copyright-holder-author}

source: In these resources, we maintain a distinction between the copyright holder and the author. The author (also known as creator) is the person who sat down and created a work. Think of the author as a programmer, writer, or artist.
es: En estos recursos, mantenemos una distinción entre el titular de los derechos de autor y el autor. El autor (también conocido como creador) es la persona que crea una obra. Piensa en el autor como un programador, escritor o artista.
fr: Dans ces ressources, nous maintenons une distinction entre le détenteur du droit d'auteur et l'auteur. L'auteur (également appelé créateur) est la personne qui s'est assise et a créé une œuvre. Considérez l'auteur comme un programmeur, un écrivain ou un artiste.
uk: У цих ресурсах ми підтримуємо різницю між власником авторських прав і автором. Автор (також відомий як творець) — це людина, яка сіла і створила щось. Подумайте про автора як про програміста, письменника або художника.

source: The copyright holder is the person who has the exclusive rights over that work. Often the author and the copyright holder are the same. However, if the author is being paid by their employer to create a work, the employer is often the copyright holder.
es: El titular de los derechos de autor es la persona que tiene los derechos exclusivos sobre esa obra. A menudo, el autor y el titular de los derechos de autor son la misma persona. Sin embargo, si el empleador le paga al autor para crear una obra, el empleador suele ser el titular de los derechos de autor.
fr: Le détenteur du droit d'auteur est la personne qui détient les droits exclusifs sur cette œuvre. Souvent, l'auteur et le détenteur du droit d'auteur sont les mêmes. Cependant, si l'auteur est payé par son employeur pour créer une œuvre, l'employeur est souvent le détenteur du droit d'auteur.
uk: Правовласником є особа, яка має виключні права на цей твір. Часто автор і власник авторських прав — це одна особа. Однак, якщо автору за створення твору платить роботодавець, тоді цей роботодавець часто є власником авторських прав.

source: Keep in mind that in some jurisdictions, the word "author" is often used as a synonym for "copyright holder". In other jurisdictions, authors maintain some rights over their work even if they are not the copyright holder.
es: Tenga en cuenta que en algunas jurisdicciones, la palabra "autor" se usa a menudo como sinónimo de "titular de los derechos de autor". En otras jurisdicciones, los autores mantienen algunos derechos sobre su trabajo incluso si no son los titulares de los derechos de autor.
fr: Gardez à l'esprit que dans certaines juridictions, le mot «auteur» est souvent utilisé comme synonyme de «détenteur du droit d'auteur». Dans d'autres juridictions, les auteurs conservent certains droits sur leur travail même s'ils ne sont pas détenteurs des droits d'auteur.
uk: Майте на увазі, що в деяких юрисдикціях слово «автор» часто вживається синонімом «власник авторських прав». В інших юрисдикціях автори зберігають деякі права на свою роботу, навіть якщо вони не є правовласниками.

source: I changed a single line of code. Should I add an SPDX-FileCopyrightText tag with my name? {#when-copyright}
es: Cambié una sola línea de código. ¿Debo agregar una etiqueta SPDX-FileCopyrightText con mi nombre? {#when-copyright}
fr: J'ai changé une seule ligne de code. Dois-je ajouter une balise SPDX-FileCopyrightText avec mon nom ? {#when-copyright}
uk: Я змінив один рядок коду. Чи слід додавати тег SPDX-FileCopyrightText зі своїм ім'ям? {#when-copyright}

source: The core question here is: At what point should I consider myself a copyright holder over a file? This is up to your discretion. It might help to be consistent and add the tag to every file you touch, but it is perhaps more valuable to reach a consensus about this within your project.
es: La pregunta central aquí es: ¿En qué momento debo considerarme titular de los derechos de autor sobre un archivo? Depende de usted. Puede ser útil ser coherente y agregar la etiqueta a cada archivo que toca, pero quizás sea más valioso llegar a un consenso sobre esto dentro de su proyecto.
fr: La question fondamentale ici est la suivante : à quel moment dois-je me considérer comme détenteur du droit d'auteur sur un fichier ? Ceci est à votre discrétion. Il peut être utile d'être cohérent et d'ajouter la balise à chaque fichier que vous touchez, mais il est peut-être plus utile de parvenir à un consensus à ce sujet dans votre projet.
uk: Основне питання тут: У який момент я повинен вважати себе власником авторських прав над файлом? Це на ваш розсуд. Це може допомогти бути послідовним і додати тег до кожного файлу, до якого ви торкаєтеся, але, можливо, ціннішим є досягнення консенсусу щодо цього у вашому проєкті.

source: How do I deal with a file that has been edited by many people? {#many-copyright-statements}
es: ¿Qué hago con un archivo que ha sido editado por muchas personas? {#many-copyright-statements}
fr: Comment gérer un fichier qui a été modifié par de nombreuses personnes ? {#many-copyright-statements}
uk: Як бути з файлом, який змінювали багато людей? {#many-copyright-statements}

source: Some files are edited by many people and would have an extremely long list of copyright holders in the header. This may be aesthetically unpleasing, but is not incorrect.
es: Algunos archivos son editados por muchas personas y podrían tener una larga lista de titulares de derechos de autor en el encabezado. Esto puede resultar estéticamente desagradable, pero no es incorrecto.
fr: Certains fichiers sont édités par de nombreuses personnes et auraient une liste extrêmement longue de titulaires de droits d'auteur dans l'en-tête. Cela peut être esthétiquement déplaisant, mais ce n'est pas incorrect.
uk: Деякі файли змінюються багатьма користувачами й мають надзвичайно довгий список власників авторських прав у заголовку. Це може бути приємно, але не є неправильним.

source: If you would rather not deal with having so many copyright notices, some projects such as Chromium circumvent this problem by using "Copyright (c) 2013 The Chromium Authors" as their copyright tag. You may consider doing this, but then you should keep a list of copyright holders and authors in a separate file in your project.
es: Si prefiere no lidiar con tantos avisos de derechos de autor, algunos proyectos como Chromium eluden este problema usando "Copyright (c) 2013 The Chromium Authors" como su etiqueta de derechos de autor. Puede considerar hacer esto, pero luego debe mantener una lista de propietarios de derechos de propietarios y autores en un archivo separado en su proyecto.
fr: Si vous préférez ne pas avoir autant d'avis de droits d'auteur, certains projets tels que Chromium contournent ce problème en utilisant "Copyright (c) 2013 The Chromium Authors" comme étiquette de droit d'auteur. Vous pouvez envisager de le faire, mais vous devriez alors conserver une liste des détenteurs de droits d'auteur et des auteurs dans un fichier séparé de votre projet.
uk: Якщо ви не хочете мати справу з такою кількістю повідомлень про авторські права, деякі проєкти, такі як Chromium, обходять цю проблему, застосовуючи «Авторське право (c) 2013 Автори Chromium» міткою авторських прав. Ви можете розглянути такий спосіб, але тоді ви повинні тримати список правовласників і авторів в окремому файлі у вашому проєкті.

source: Why can't I just use version control to record copyright? {#vcs-copyright}
es: ¿Por qué no puedo simplemente usar el control de versiones para registrar los derechos de autor? {#vcs-copyright}
fr: Pourquoi ne puis-je pas simplement utiliser le contrôle de version pour enregistrer les droits d'auteur ? {#vcs-copyright}
uk: Чому я не можу просто застосовувати керування версіями для запису авторських прав? {#vcs-copyright}

source: In [a previous question](#copyright-holder-author), we distinguished between copyright holders and authors, which are not always the same. Version control typically only records authorship, which makes it unsuitable for the task of recording copyright.
es: En [una pregunta anterior](#copyright-holder-author), distinguimos entre titulares de derechos de autor y autores, que no siempre son los mismos. El control de versiones generalmente solo registra la autoría, lo que lo hace inadecuado para la tarea de registrar los derechos de autor.
fr: Dans [une question précédente](#copyright-holder-author), nous avons fait une distinction entre les détenteurs de droits d'auteur et les auteurs, qui ne sont pas toujours les mêmes. Le contrôle de version n'enregistre généralement que l'auteur, ce qui le rend impropre à la tâche d'enregistrement des droits d'auteur.
uk: У [попередньому питанні](#copyright-holder-author) ми розрізняли власників авторських прав та авторів, які не завжди однакові. Контроль версій зазвичай записує лише авторство, що робить його непридатним для запису авторських прав.

source: Another obstacle is that version control history may contain errors, and fixing such an error would require rewriting the history, causing all contributors to have to re-download the new trunk.
es: Otro obstáculo es que el historial de control de versiones puede contener errores, y corregir dicho error requeriría volver a escribir el historial, lo que haría que todos los contribuidores tuvieran que volver a descargar el nuevo tronco.
fr: Un autre obstacle est que l'historique du contrôle de version peut contenir des erreurs, et la correction d'une telle erreur nécessiterait de réécrire l'historique, obligeant tous les contributeurs à télécharger à nouveau le nouveau tronc.
uk: Інша проблема полягає можливій наявності помилок в історії керування версіями, а виправлення такої помилки вимагатиме переписування історії, в результаті чого всім дописувачам доведеться повторно завантажити свій внесок.

source: A further issue with version control is that the `blame` command that is typically (mis)used to find authorship line-by-line shows only the author of the last commit in that line, even if it was just something as trivial as fixing a typo.
es: Otro problema con el control de versiones es que el comando `blame` que normalmente se (mal)usa para encontrar la autoría línea por línea muestra solo el autor del último comentario en esa línea, incluso si se trata de algo tan trivial como corregir un error.
fr: Un autre problème avec le contrôle de version est que la commande `blame` qui est généralement (mal) utilisée pour trouver l'auteur ligne par ligne montre uniquement l'auteur du dernier commit dans cette ligne, même si c'était juste quelque chose d'aussi trivial que de réparer une faute de frappe.
uk: Ще одна проблема з керуванням версіями полягає в тому, що команда `blame`, яка зазвичай застосовується для пошуку авторства по рядках, показує лише автора останнього подання у цьому рядку, навіть якщо це було щось таке банальне, як виправлення помилки.

source: Can I bulk-license whole directories? {#bulk-license}
es: ¿Puedo obtener licencias masivas de directorios completos? {#bulk-license}
fr: Puis-je utiliser une licence en bloc pour des répertoires entiers ? {#bulk-license}
uk: Чи можу я ліцензувати цілі каталоги? {#bulk-license}

source: If you have a directory containing many files, it may not be easy or practical to edit every file to contain a header. While doing this would be ideal, there is an alternative. By creating the file `.reuse/dep5` in the root of your project, you can bulk-license a directory. Example:
es: Si tiene un directorio que contiene muchos archivos, puede que no sea fácil ni práctico editar cada archivo para que contenga un encabezado. Si bien hacer esto sería ideal, hay una alternativa. Crear el archivo `.reuse/dep5` en la raíz de su proyecto, puede obtener una licencia masiva de un directorio. Ejemplo:
fr: Si vous avez un répertoire contenant de nombreux fichiers, il peut ne pas être facile ou pratique de modifier chaque fichier pour contenir un en-tête. Bien que cela soit idéal, il existe une alternative. En créant le fichier `.reuse/dep5` à la racine de votre projet, vous pouvez attribuer une licence en bloc à un répertoire. Exemple :
uk: Якщо у вас є каталог, що містить багато файлів, може бути нелегко або непрактично редагувати кожен файл, щоб додати заголовок. Хоча це було б ідеально, існує альтернатива. Створивши файл `.reuse/dep5` в корені проєкту, можна ліцензувати цілий каталог. Наприклад:

source: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: my-project Upstream-Contact: Jane Doe <jane@example.com> Source: https://git.example.com/jane/my-project Files: resources/img/* Copyright: 2017 Jane Doe <jane@example.com> License: CC-BY-4.0 Files: resources/vid/* Copyright: 2017 Jane Doe <jane@example.com> 2017 John Doe <john@example.com> License: CC0-1.0
es: Format: https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/ Upstream-Name: mi-proyecto Upstream-Contact: Jane Doe <jane@example.com> Source: https://git.example.com/jane/mi-proyecto Files: resources/img/* Copyright: 2017 Jane Doe <jane@example.com> Licencia: CC-BY-4.0 Files: resources/vid/* Copyright: 2017 Jane Doe <jane@example.com> 2017 John Doe <john@example.com> Licencia: CC0-1.0

source: You can read more about this file format by Debian [here](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
es: Puede leer más sobre este formato de archivo de Debian [aquí](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
fr: Vous pouvez en savoir plus sur ce format de fichier par Debian [ici](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).
uk: Докладніше про цей формат файлів від Debian ви можете прочитати [тут](https://www.debian.org/doc/packaging-manuals/copyright-format/1.0/).

source: Can I license only a part of a file as being under a different license? {#partial-license}
es: ¿Puedo licenciar solo una parte de un archivo como si estuviera bajo una licencia diferente? {#partial-license}
fr: Puis-je attribuer une licence uniquement à une partie d'un fichier comme étant sous une licence différente ? {#partial-license}
uk: Чи можна ліцензувати лише частину файлу під іншою ліцензією? {#partial-license}

source: The short answer is that yes, you can, but no, there is no standard way for REUSE to recognize this. If you have a small segment of a file that is licensed differently, you should list that license under a separate `SPDX-License-Identifier` tag in the header.
es: La respuesta corta es que sí, se puede, pero no, no hay una manera estándar para que REUSE reconozca esto. Si tiene un pequeño segmento de un archivo que tiene una licencia diferente, debe enumerar esa licencia bajo una etiqueta separada `SPDX-License-Identifier` en la cabecera.
fr: La réponse courte est que oui, vous pouvez, mais non, il n'y a pas de moyen standard pour REUSE de reconnaître cela. Si vous avez un petit segment d'un fichier dont la licence est différente, vous devez répertorier cette licence sous une balise `SPDX-License-Identifier` distincte dans l'en-tête.
uk: Якщо коротко, то так, ви можете, але немає стандартного способу для REUSE розпізнати це. Якщо у вас є невеликий сегмент файлу, який ліцензується інакше, слід у заголовку вказати цю ліцензію під окремим тегом `SPDX-License-Identifier`.

source: You can use your own comments to specify which segment is separately licensed. For instance: "The class Foo is copied from project Bar and licensed under MIT. All changes are licensed under GPL-3.0-or-later."
es: Puede usar sus propios comentarios para especificar qué segmento tiene una licencia separada. Por ejemplo: "La clase Foo se copia del proyecto Bar y tiene licencia del MIT. Todos los cambios tienen licencia GPL-3.0 o posterior."
fr: Vous pouvez utiliser vos propres commentaires pour spécifier quel segment fait l'objet d'une licence distincte. Par exemple : "La classe Foo est copiée à partir du projet Bar et sous licence MIT. Toutes les modifications sont sous licence GPL-3.0 ou ultérieure."
uk: Ви можете писати власні коментарі, щоб вказати, який сегмент ліцензується окремо. Наприклад: «The class Foo is copied from project Bar and licensed under MIT. All changes are licensed under GPL-3.0-or-later.»

source: A possible way to circumvent the problem is to extract the segment from the file, and to keep it in its own file.
es: Una forma posible de eludir el problema es extraer el segmento del archivo y ponerlo en su propio archivo.
fr: Une manière possible de contourner le problème consiste à extraire le segment du fichier et à le conserver dans son propre fichier.
uk: Можливий спосіб обійти проблему — витягти сегмент з файлу та зберегти його в окремому файлі.

source: How do I properly declare multi-licensing? {#multi-licensing}
es: ¿Cómo declaro correctamente las licencias múltiples? {#multi-licensing}
fr: Comment déclarer correctement les licences multiples ? {#multi-licensing}
uk: Як правильно заявити про багатоліцензійність? {#multi-licensing}

source: You should always include all licenses in the `LICENSES/` directory.
es: Siempre debe incluir todas las licencias en el directorio `LICENSES/`.
fr: Vous devez toujours inclure toutes les licences dans le répertoire `LICENSES/`.
uk: Ви завжди повинні включати всі ліцензії в каталог `LICENSES/`.

source: The correct SPDX license expression that applies to the file depends on the intent. If all the code within is licensed under multiple licenses, and the licensee can choose under which license they consume the work, use `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, as parts of Firefox do.
es: La expresión de licencia SPDX correcta que se aplica al archivo depende de la intención. Si todo el código contenido tiene varias licencias y el licenciatario puede elegir bajo qué licencia utiliza el trabajo, use `SPDX-License-Identifier: MPL-1.1 O GPL-2.0-o posterior O LGPL-2.1-o- posterior`, como lo hacen partes de Firefox.
fr: L'expression de licence SPDX correcte qui s'applique au fichier dépend de l'intention. Si tout le code qu'il contient est concédé sous plusieurs licences et que le titulaire de la licence peut choisir sous quelle licence il utilise le travail, utilisez `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, comme le font certaines parties de Firefox.
uk: Правильний вираз ліцензії SPDX, який застосовується до файлу, залежить від способу. Якщо весь код всередині ліцензований під кількома ліцензіями, і ліцензіат може вибрати, за якою ліцензією він надає твір, використовуйте `SPDX-License-Identifier: MPL-1.1 OR GPL-2.0-or-later OR LGPL-2.1-or-later`, як це робить Firefox.

source: If all the code within the file is licensed under multiple licenses, and the user must comply with all licenses simultaneously, use `SPDX-License-Identifier: LGPL-2.0-or-later AND AML`, as can be found in Simple DirectMedia Layer (SDL).
es: Si todo el código dentro del archivo tiene varias licencias y el usuario debe cumplir con todas las licencias simultáneamente, use `SPDX-License-Identifier: LGPL-2.0-or-posterior Y AML`, como se puede encontrar en Simple DirectMedia Layer (SDL).
fr: Si tout le code du fichier est concédé sous plusieurs licences et que l'utilisateur doit se conformer à toutes les licences simultanément, utilisez `SPDX-License-Identifier: LGPL-2.0-or-later AND AML`, comme on peut le trouver dans Simple DirectMedia Layer (SDL).
uk: Якщо весь код у файлі ліцензовано кількома ліцензіями, і користувач повинен прийняти всі ліцензії одночасно, застосуйте `SPDX-License-Identifier: LGPL-2.0-or-later AND AML`, як це можна знайти в Simple DirectMedia Layer (SDL).

source: If all the code within the file is licensed under either one license or another (for instance, all code is under GPL-2.0-only, but one function is under MIT), use separate tags `SPDX-License-Identifier: GPL-2.0-only` and `SPDX-License-Identifier: MIT`.
es: Si todo el código dentro del archivo tiene una u otra licencia (por ejemplo, todo el código está bajo GPL-2.0 solamente, pero una función está bajo MIT), use etiquetas separadas `SPDX-License-Identifier: GPL-2.0 -solamente` y `SPDX-License-Identifier: MIT`.
fr: Si tout le code du fichier est concédé sous une licence ou une autre (par exemple, tout le code est sous GPL-2.0 uniquement, mais une fonction est sous MIT), utilisez des balises séparées `SPDX-License-Identifier: GPL-2.0 -only` et `SPDX-License-Identifier: MIT `.
uk: Якщо весь код у файлі ліцензовано однією ліцензією або іншою (наприклад, весь код ліцензовано лише GPL-2.0, але одна функція має ліцензію MIT), застосовуйте окремі теги `SPDX-License-Identifier: GPL-2.0-only` and `SPDX-License-Identifier: MIT`.

source: You can read more about SPDX expressions [on the SPDX wiki](https://wiki.spdx.org/view/LicenseExpressionFAQ).
es: Puede leer más sobre las expresiones SPDX [en la wiki de SPDX] (https://wiki.spdx.org/view/LicenseExpressionFAQ).
fr: Vous pouvez en savoir plus sur les expressions SPDX [sur le wiki SPDX](https://wiki.spdx.org/view/LicenseExpressionFAQ).
uk: Докладніше про вирази SPDX [у вікі SPDX](https://wiki.spdx.org/view/LicenseExpressionFAQ).

source: <!-- ## How to deal with MIT/BSD licenses which include copyright information themselves? {#mit-bsd}
es: <!-- ## ¿Cómo lidiar con las licencias MIT/BSD que incluyen información de derechos de autor? {#mit-bsd}
fr: <!-- ## Comment gérer les licences MIT/BSD qui incluent elles-mêmes des informations de droit d'auteur ? {#mit-bsd}
uk: <!-- ## Як бути з ліцензіями MIT/BSD, які самі включають дані про авторські права? {#mit-bsd}

source: TODO: Figure this one out -->
es: TODO: Averigue esto -->
uk: TODO: З'ясувати це -->

source: I only have a single license file. Should I still create a LICENSES directory? {#single-license}
es: Tengo un archivo de licencia simple. ¿Debo seguir creando un directorio de LICENCIAS? {#single-license}
fr: Je n'ai qu'un seul fichier de licence. Dois-je toujours créer un répertoire LICENSES ? {#single-license}
uk: У мене є лише один файл ліцензії. Чи все одно потрібно створювати каталог LICENSES? {#single-license}
